-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th7 11, 2024 lúc 04:55 PM
-- Phiên bản máy phục vụ: 10.4.32-MariaDB
-- Phiên bản PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `new`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `activacation_code`
--

CREATE TABLE `activacation_code` (
  `activationCode` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `username` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `date_limit` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `activacation_code`
--

INSERT INTO `activacation_code` (`activationCode`, `username`, `password`, `email`, `date_limit`) VALUES
('2024-07-05cGKvZrnVWT', 'qa', '123hihi', 'tam1442k3@gmail.com', '2024-07-05 14:51:25'),
('2024-07-05qFkjNgtIQX', 'qa', '111hihi', 'tam1442k3@gmail.com', '2024-07-05 14:57:38'),
('2024-07-05Xp6IHZz7hi', 'qa', '111hihi', 'tam1442k3@gmail.com', '2024-07-05 14:54:55');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `category_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  `deleted_at` datetime DEFAULT NULL,
  `status` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `img_link` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `categories`
--

INSERT INTO `categories` (`id`, `category_name`, `created_at`, `updated_at`, `deleted_at`, `status`, `img_link`) VALUES
(1, 'Ruby', '2024-01-10 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/ruby-e1703317900141.jpg'),
(2, 'Sapphire', '2024-02-10 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/pink-sapphire.jpg'),
(3, 'Ngọc lục bảo', '2024-01-01 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/ngoc-luc-bao.jpg'),
(4, 'Spinel', '2024-03-10 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/spinel.jpg'),
(5, 'Tourmaline', '2023-12-10 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/GREEN-TOURMALINE.jpg'),
(6, 'Aquamarine', '2024-02-27 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/aquamarine.jpg'),
(7, 'Peridot', '2024-03-15 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/Peridot.jpg'),
(8, 'Garnet', '2024-03-03 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/garnet.jpg'),
(9, 'Zircon', '2024-02-06 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/zircon.jpg'),
(10, 'Topaz', '2024-02-14 00:00:00', NULL, NULL, NULL, 'https://iruby.vn/wp-content/uploads/2023/10/topaz-1.jpg');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `inventories`
--

CREATE TABLE `inventories` (
  `id` int(11) NOT NULL,
  `date` datetime NOT NULL DEFAULT current_timestamp(),
  `user_imported` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `inventories`
--

INSERT INTO `inventories` (`id`, `date`, `user_imported`) VALUES
(1, '2024-05-08 21:27:59', 'ADMIN'),
(2, '2024-05-08 21:27:59', 'ADMIN'),
(3, '2024-05-08 21:27:59', 'ADMIN'),
(5, '2024-05-08 21:29:41', 'ADMIN'),
(6, '2024-05-08 21:29:41', 'ADMIN'),
(7, '2024-05-08 21:29:41', 'ADMIN'),
(367, '2024-07-11 19:18:56', 'ADMIN'),
(368, '2024-07-11 21:26:27', 'ADMIN'),
(369, '2024-07-11 21:37:36', 'ADMIN'),
(370, '2024-07-11 21:45:16', 'ADMIN'),
(371, '2024-07-11 21:51:55', 'ADMIN'),
(372, '2024-07-11 21:52:31', 'ADMIN');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `inventory_detail`
--

CREATE TABLE `inventory_detail` (
  `id` int(11) NOT NULL,
  `product_id` int(5) NOT NULL,
  `quantity` int(15) NOT NULL,
  `price` float NOT NULL,
  `status_deleted` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `remaining` int(5) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `inventory_detail`
--

INSERT INTO `inventory_detail` (`id`, `product_id`, `quantity`, `price`, `status_deleted`, `remaining`) VALUES
(1, 20, 50, 6090000, '', 50),
(2, 20, 40, 6090000, '', 50),
(3, 20, 35, 6090000, '', 50),
(5, 25, 40, 5000000, '', 50),
(6, 25, 30, 5000000, '', 50),
(7, 25, 40, 5000000, '', 50),
(8, 0, 0, 100000, 'chưa xóa', 0),
(9, 102, 21, 10000, 'chưa xóa', 21),
(10, 103, 12, 100000, 'chưa xóa', 12),
(11, 104, 12, 100000, 'chưa xóa', 12),
(12, 101, 12, 5000000, 'chưa xóa', 12),
(13, 106, 12, 5000000, 'chưa xóa', 12);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `log`
--

CREATE TABLE `log` (
  `id` int(5) NOT NULL,
  `ip_address` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `prev_value` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `current_value` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `level` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `log`
--

INSERT INTO `log` (`id`, `ip_address`, `prev_value`, `current_value`, `created_at`, `level`) VALUES
(1, '1.2.3.4.5', 'model.modelAdmin.ProductAdmin@6df88031', 'model.modelAdmin.ProductAdmin@f5d61b7', '2024-05-21 10:16:34', 'ALERT'),
(2, '1.2.3.4.5', 'model.modelAdmin.ProductAdmin@5da878b5', 'model.modelAdmin.ProductAdmin@17479a64', '2024-05-21 10:16:39', 'WARNING'),
(3, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 16:04:55.833', 'Lấy dữ liệu2024-06-20 16:04:55.833', '2024-06-20 09:04:56', 'INFORM'),
(4, '0:0:0:0:0:0:0:1', 'User có id là:3chưa xóa', 'Đã xóa3', '2024-06-20 09:05:09', 'DANGER'),
(5, '0:0:0:0:0:0:0:1', 'User có id là:16chưa thay đổi role', 'User có id là:16đã thay đổi roleprohibit', '2024-06-20 09:05:16', 'DANGER'),
(6, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 16:05:18.647', 'Lấy dữ liệu2024-06-20 16:05:18.647', '2024-06-20 09:05:18', 'INFORM'),
(7, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:45:27', 'Đã lấy dữ liệu17:45:27', '2024-06-20 10:45:27', 'INFORM'),
(8, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:45:28', 'Đã lấy dữ liệu17:45:28', '2024-06-20 10:45:28', 'INFORM'),
(9, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:45:28', 'Đã lấy dữ liệu17:45:28', '2024-06-20 10:45:28', 'INFORM'),
(10, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:45:28', 'Đã lấy dữ liệu17:45:28', '2024-06-20 10:45:28', 'INFORM'),
(11, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:45:29', 'Đã lấy dữ liệu17:45:29', '2024-06-20 10:45:29', 'INFORM'),
(12, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:45:29', 'Đã lấy dữ liệu17:45:29', '2024-06-20 10:45:29', 'INFORM'),
(13, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:45:35', 'Đã lấy dữ liệu17:45:35', '2024-06-20 10:45:35', 'INFORM'),
(14, '0:0:0:0:0:0:0:1', 'Chưa xóa17:45:36', 'Đã xóa17:45:36', '2024-06-20 10:45:36', 'DANGER'),
(15, '0:0:0:0:0:0:0:1', 'Chưa cập nhật17:45:54đơn hàng có id10', 'Đã xóa17:45:54đơn hàng có id10', '2024-06-20 10:45:54', 'DANGER'),
(16, '0:0:0:0:0:0:0:1', 'Chưa cập nhật17:46:00đơn hàng có id10', 'Đã xóa17:46:00đơn hàng có id10', '2024-06-20 10:46:00', 'DANGER'),
(17, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:03', 'Đã lấy dữ liệu17:46:03', '2024-06-20 10:46:03', 'INFORM'),
(18, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:05', 'Đã lấy dữ liệu17:46:05', '2024-06-20 10:46:05', 'INFORM'),
(19, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:05', 'Đã lấy dữ liệu17:46:05', '2024-06-20 10:46:05', 'INFORM'),
(20, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:06', 'Đã lấy dữ liệu17:46:06', '2024-06-20 10:46:06', 'INFORM'),
(21, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:06', 'Đã lấy dữ liệu17:46:06', '2024-06-20 10:46:06', 'INFORM'),
(22, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:07', 'Đã lấy dữ liệu17:46:07', '2024-06-20 10:46:07', 'INFORM'),
(23, '0:0:0:0:0:0:0:1', 'Chưa cập nhật17:46:10đơn hàng có id8', 'Đã xóa17:46:10đơn hàng có id8', '2024-06-20 10:46:10', 'DANGER'),
(24, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:14', 'Đã lấy dữ liệu17:46:14', '2024-06-20 10:46:14', 'INFORM'),
(25, '0:0:0:0:0:0:0:1', 'Chưa cập nhật17:46:23đơn hàng có id9', 'Đã xóa17:46:23đơn hàng có id9', '2024-06-20 10:46:23', 'DANGER'),
(26, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:27', 'Đã lấy dữ liệu17:46:27', '2024-06-20 10:46:27', 'INFORM'),
(27, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:27', 'Đã lấy dữ liệu17:46:27', '2024-06-20 10:46:27', 'INFORM'),
(28, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:28', 'Đã lấy dữ liệu17:46:28', '2024-06-20 10:46:28', 'INFORM'),
(29, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:28', 'Đã lấy dữ liệu17:46:28', '2024-06-20 10:46:28', 'INFORM'),
(30, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu17:46:29', 'Đã lấy dữ liệu17:46:29', '2024-06-20 10:46:29', 'INFORM'),
(31, '0:0:0:0:0:0:0:1', 'Chưa cập nhật17:46:31đơn hàng có id3', 'Đã xóa17:46:31đơn hàng có id3', '2024-06-20 10:46:31', 'DANGER'),
(32, '0:0:0:0:0:0:0:1', 'Chưa cập nhật17:46:38đơn hàng có id7', 'Đã xóa17:46:38đơn hàng có id7', '2024-06-20 10:46:38', 'DANGER'),
(33, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 19:58:50.771', 'Đã truy cập ngày:2024-06-20 19:58:50.771', '2024-06-20 12:58:50', 'INFORM'),
(34, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 19:59:43.689', 'Đã truy cập ngày:2024-06-20 19:59:43.689', '2024-06-20 12:59:43', 'INFORM'),
(35, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:01:21.228', 'Đã truy cập ngày:2024-06-20 20:01:21.228', '2024-06-20 13:01:21', 'INFORM'),
(36, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-20 20:01:22.568sản phẩm có id5', 'Đã xóa  ngày:2024-06-20 20:01:22.568sản phẩm có id5', '2024-06-20 13:01:22', 'DANGER'),
(37, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:01:25.533', 'Đã truy cập ngày:2024-06-20 20:01:25.533', '2024-06-20 13:01:25', 'INFORM'),
(38, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-20 20:02:33.122sản phẩm có id6', 'Đã xóa  ngày:2024-06-20 20:02:33.122sản phẩm có id6', '2024-06-20 13:02:33', 'DANGER'),
(39, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:02:35.765', 'Đã truy cập ngày:2024-06-20 20:02:35.765', '2024-06-20 13:02:35', 'INFORM'),
(40, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:04:39.973', 'Đã truy cập ngày:2024-06-20 20:04:40.158', '2024-06-20 13:04:40', 'INFORM'),
(41, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:05:45.705', 'Đã truy cập ngày:2024-06-20 20:05:45.705', '2024-06-20 13:05:45', 'INFORM'),
(42, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-20 20:05:49.593sản phẩm có id7', 'Đã xóa  ngày:2024-06-20 20:05:49.593sản phẩm có id7', '2024-06-20 13:05:49', 'DANGER'),
(43, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:05:52.459', 'Đã truy cập ngày:2024-06-20 20:05:52.459', '2024-06-20 13:05:52', 'INFORM'),
(44, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:08:21.604', 'Đã truy cập ngày:2024-06-20 20:08:21.604', '2024-06-20 13:08:21', 'INFORM'),
(45, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:12:42.085', 'Đã truy cập ngày:2024-06-20 20:12:42.286', '2024-06-20 13:12:42', 'INFORM'),
(46, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:14:12.113', 'Đã truy cập ngày:2024-06-20 20:14:12.113', '2024-06-20 13:14:12', 'INFORM'),
(47, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:16:49.491', 'Đã truy cập ngày:2024-06-20 20:16:49.491', '2024-06-20 13:16:49', 'INFORM'),
(48, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:20:36.736', 'Đã truy cập ngày:2024-06-20 20:20:36.736', '2024-06-20 13:20:36', 'INFORM'),
(49, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:25:14.531', 'Đã truy cập ngày:2024-06-20 20:25:14.531', '2024-06-20 13:25:14', 'INFORM'),
(50, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 20:32:23.894', 'Đã truy cập ngày:2024-06-20 20:32:23.894', '2024-06-20 13:32:24', 'INFORM'),
(51, '0:0:0:0:0:0:0:1', 'Chưa  cập nhật thành công sản phẩm có id:162024-06-20 20:32:31.849', 'Đã cập nhật thành công sản phẩm có id:162024-06-20 20:32:31.849', '2024-06-20 13:32:31', 'DANGER'),
(52, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-06-20 21:08:24.834', '2024-06-20 14:08:24', 'ALERT'),
(53, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 21:11:36.387', 'Đã truy cập ngày:2024-06-20 21:11:36.387', '2024-06-20 14:11:36', 'INFORM'),
(54, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:12:36.089', 'Lấy dữ liệu2024-06-20 21:12:36.089', '2024-06-20 14:12:36', 'INFORM'),
(55, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 21:13:10.257', 'Đã truy cập ngày:2024-06-20 21:13:10.257', '2024-06-20 14:13:10', 'INFORM'),
(56, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 21:13:12.387', 'Đã truy cập ngày:2024-06-20 21:13:12.387', '2024-06-20 14:13:12', 'INFORM'),
(57, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:13:14.034', 'Lấy dữ liệu2024-06-20 21:13:14.034', '2024-06-20 14:13:14', 'INFORM'),
(58, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:13:41.488', 'Lấy dữ liệu2024-06-20 21:13:41.488', '2024-06-20 14:13:41', 'INFORM'),
(59, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:24:27.872', 'Lấy dữ liệu2024-06-20 21:24:27.872', '2024-06-20 14:24:28', 'INFORM'),
(60, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:31:21.027', 'Lấy dữ liệu2024-06-20 21:31:21.027', '2024-06-20 14:31:21', 'INFORM'),
(61, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:32:36.798', 'Lấy dữ liệu2024-06-20 21:32:36.798', '2024-06-20 14:32:36', 'INFORM'),
(62, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:39:22', 'Đã lấy dữ liệu21:39:22', '2024-06-20 14:39:22', 'INFORM'),
(63, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:39:28', 'Đã lấy dữ liệu21:39:28', '2024-06-20 14:39:28', 'INFORM'),
(64, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:39:29', 'Đã lấy dữ liệu21:39:29', '2024-06-20 14:39:29', 'INFORM'),
(65, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:39:31', 'Đã lấy dữ liệu21:39:31', '2024-06-20 14:39:31', 'INFORM'),
(66, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:39:33', 'Đã lấy dữ liệu21:39:33', '2024-06-20 14:39:33', 'INFORM'),
(67, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:41:43.926', 'Lấy dữ liệu2024-06-20 21:41:43.926', '2024-06-20 14:41:43', 'INFORM'),
(68, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:41:50', 'Đã lấy dữ liệu21:41:50', '2024-06-20 14:41:50', 'INFORM'),
(69, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:41:52', 'Đã lấy dữ liệu21:41:52', '2024-06-20 14:41:52', 'INFORM'),
(70, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:41:53', 'Đã lấy dữ liệu21:41:53', '2024-06-20 14:41:53', 'INFORM'),
(71, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:41:54', 'Đã lấy dữ liệu21:41:54', '2024-06-20 14:41:54', 'INFORM'),
(72, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:41:55', 'Đã lấy dữ liệu21:41:55', '2024-06-20 14:41:55', 'INFORM'),
(73, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:42:11', 'Đã lấy dữ liệu21:42:11', '2024-06-20 14:42:11', 'INFORM'),
(74, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:42:14', 'Đã lấy dữ liệu21:42:14', '2024-06-20 14:42:14', 'INFORM'),
(75, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:42:15', 'Đã lấy dữ liệu21:42:15', '2024-06-20 14:42:15', 'INFORM'),
(76, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:42:15', 'Đã lấy dữ liệu21:42:15', '2024-06-20 14:42:15', 'INFORM'),
(77, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu21:42:16', 'Đã lấy dữ liệu21:42:16', '2024-06-20 14:42:16', 'INFORM'),
(78, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 21:44:12.288', 'Đã truy cập ngày:2024-06-20 21:44:12.288', '2024-06-20 14:44:12', 'INFORM'),
(79, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:50:36.994', 'Lấy dữ liệu2024-06-20 21:50:36.994', '2024-06-20 14:50:36', 'INFORM'),
(80, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:51:32.319', 'Lấy dữ liệu2024-06-20 21:51:32.319', '2024-06-20 14:51:32', 'INFORM'),
(81, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:51:34.228', 'Lấy dữ liệu2024-06-20 21:51:34.228', '2024-06-20 14:51:34', 'INFORM'),
(82, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 21:51:37.67', 'Đã truy cập ngày:2024-06-20 21:51:37.67', '2024-06-20 14:51:37', 'INFORM'),
(83, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-20 21:51:40.813', 'Đã truy cập ngày:2024-06-20 21:51:40.813', '2024-06-20 14:51:40', 'INFORM'),
(84, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-20 21:51:42.803', 'Lấy dữ liệu2024-06-20 21:51:42.803', '2024-06-20 14:51:42', 'INFORM'),
(85, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-22 21:09:12.488', 'Đã truy cập ngày:2024-06-22 21:09:12.488', '2024-06-22 14:09:12', 'INFORM'),
(86, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:09:17.011sản phẩm có id8', 'Đã xóa  ngày:2024-06-22 21:09:17.011sản phẩm có id8', '2024-06-22 14:09:17', 'DANGER'),
(87, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:09:27.128sản phẩm có id8', 'Đã xóa  ngày:2024-06-22 21:09:27.128sản phẩm có id8', '2024-06-22 14:09:27', 'DANGER'),
(88, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-06-22 21:09:29.804', 'Đã truy cập ngày:2024-06-22 21:09:29.804', '2024-06-22 14:09:29', 'INFORM'),
(89, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:09:37.69sản phẩm có id9', 'Đã xóa  ngày:2024-06-22 21:09:37.69sản phẩm có id9', '2024-06-22 14:09:37', 'DANGER'),
(90, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:09:43.24sản phẩm có id9', 'Đã xóa  ngày:2024-06-22 21:09:43.24sản phẩm có id9', '2024-06-22 14:09:43', 'DANGER'),
(91, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:09:49.614sản phẩm có id11', 'Đã xóa  ngày:2024-06-22 21:09:49.614sản phẩm có id11', '2024-06-22 14:09:49', 'DANGER'),
(92, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:09:52.503sản phẩm có id11', 'Đã xóa  ngày:2024-06-22 21:09:52.503sản phẩm có id11', '2024-06-22 14:09:52', 'DANGER'),
(93, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:10:57.954sản phẩm có id10', 'Đã xóa  ngày:2024-06-22 21:10:57.954sản phẩm có id10', '2024-06-22 14:10:57', 'DANGER'),
(94, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:11:07.02sản phẩm có id10', 'Đã xóa  ngày:2024-06-22 21:11:07.02sản phẩm có id10', '2024-06-22 14:11:07', 'DANGER'),
(95, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:11:10.651sản phẩm có id12', 'Đã xóa  ngày:2024-06-22 21:11:10.651sản phẩm có id12', '2024-06-22 14:11:10', 'DANGER'),
(96, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:11:22.443sản phẩm có id12', 'Đã xóa  ngày:2024-06-22 21:11:22.443sản phẩm có id12', '2024-06-22 14:11:22', 'DANGER'),
(97, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:11:44.603sản phẩm có id17', 'Đã xóa  ngày:2024-06-22 21:11:44.603sản phẩm có id17', '2024-06-22 14:11:44', 'DANGER'),
(98, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-06-22 21:12:24.93sản phẩm có id17', 'Đã xóa  ngày:2024-06-22 21:12:24.93sản phẩm có id17', '2024-06-22 14:12:24', 'DANGER'),
(99, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-06-22 21:17:53.477', 'Lấy dữ liệu2024-06-22 21:17:53.477', '2024-06-22 14:17:53', 'INFORM'),
(100, '0:0:0:0:0:0:0:1', 'User có id là:1chưa xóa', 'Đã xóa1', '2024-06-22 14:17:58', 'DANGER'),
(101, '0:0:0:0:0:0:0:1', 'User có id là:16chưa xóa', 'Đã xóa16', '2024-06-22 14:18:03', 'DANGER'),
(102, '0:0:0:0:0:0:0:1', 'User có id là:3chưa xóa', 'Đã xóa3', '2024-06-22 14:18:06', 'DANGER'),
(103, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:31:14', 'Đã lấy dữ liệu14:31:14', '2024-07-08 07:31:14', 'INFORM'),
(104, '0:0:0:0:0:0:0:1', 'Chưa cập nhật14:32:05đơn hàng có id16', 'Đã xóa14:32:05đơn hàng có id16', '2024-07-08 07:32:05', 'DANGER'),
(105, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:32:08', 'Đã lấy dữ liệu14:32:08', '2024-07-08 07:32:08', 'INFORM'),
(106, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:32:10', 'Đã lấy dữ liệu14:32:10', '2024-07-08 07:32:10', 'INFORM'),
(107, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:32:10', 'Đã lấy dữ liệu14:32:10', '2024-07-08 07:32:10', 'INFORM'),
(108, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:32:11', 'Đã lấy dữ liệu14:32:11', '2024-07-08 07:32:11', 'INFORM'),
(109, '0:0:0:0:0:0:0:1', 'Chưa cập nhật14:36:01đơn hàng có id1', 'Đã xóa14:36:01đơn hàng có id1', '2024-07-08 07:36:01', 'DANGER'),
(110, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:03', 'Đã lấy dữ liệu14:36:03', '2024-07-08 07:36:03', 'INFORM'),
(111, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:06', 'Đã lấy dữ liệu14:36:06', '2024-07-08 07:36:06', 'INFORM'),
(112, '0:0:0:0:0:0:0:1', 'Chưa cập nhật14:36:23đơn hàng có id18', 'Đã xóa14:36:23đơn hàng có id18', '2024-07-08 07:36:23', 'DANGER'),
(113, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:33', 'Đã lấy dữ liệu14:36:33', '2024-07-08 07:36:33', 'INFORM'),
(114, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:33', 'Đã lấy dữ liệu14:36:33', '2024-07-08 07:36:33', 'INFORM'),
(115, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:34', 'Đã lấy dữ liệu14:36:34', '2024-07-08 07:36:34', 'INFORM'),
(116, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:35', 'Đã lấy dữ liệu14:36:35', '2024-07-08 07:36:35', 'INFORM'),
(117, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:36', 'Đã lấy dữ liệu14:36:36', '2024-07-08 07:36:36', 'INFORM'),
(118, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:36', 'Đã lấy dữ liệu14:36:36', '2024-07-08 07:36:36', 'INFORM'),
(119, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:37', 'Đã lấy dữ liệu14:36:37', '2024-07-08 07:36:37', 'INFORM'),
(120, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:36:37', 'Đã lấy dữ liệu14:36:37', '2024-07-08 07:36:37', 'INFORM'),
(121, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:02', 'Đã lấy dữ liệu14:37:02', '2024-07-08 07:37:02', 'INFORM'),
(122, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:24', 'Đã lấy dữ liệu14:37:24', '2024-07-08 07:37:24', 'INFORM'),
(123, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:31', 'Đã lấy dữ liệu14:37:31', '2024-07-08 07:37:31', 'INFORM'),
(124, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:32', 'Đã lấy dữ liệu14:37:32', '2024-07-08 07:37:32', 'INFORM'),
(125, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:33', 'Đã lấy dữ liệu14:37:33', '2024-07-08 07:37:33', 'INFORM'),
(126, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:35', 'Đã lấy dữ liệu14:37:35', '2024-07-08 07:37:35', 'INFORM'),
(127, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:36', 'Đã lấy dữ liệu14:37:36', '2024-07-08 07:37:36', 'INFORM'),
(128, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:37', 'Đã lấy dữ liệu14:37:37', '2024-07-08 07:37:37', 'INFORM'),
(129, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:37', 'Đã lấy dữ liệu14:37:37', '2024-07-08 07:37:37', 'INFORM'),
(130, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:37', 'Đã lấy dữ liệu14:37:37', '2024-07-08 07:37:37', 'INFORM'),
(131, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:37', 'Đã lấy dữ liệu14:37:37', '2024-07-08 07:37:37', 'INFORM'),
(132, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:37:38', 'Đã lấy dữ liệu14:37:38', '2024-07-08 07:37:38', 'INFORM'),
(133, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 14:40:55.542', 'Đã truy cập ngày:2024-07-08 14:40:55.542', '2024-07-08 07:40:55', 'INFORM'),
(134, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 14:40:56.503', 'Lấy dữ liệu2024-07-08 14:40:56.503', '2024-07-08 07:40:56', 'INFORM'),
(135, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 14:40:58.241', 'Lấy dữ liệu2024-07-08 14:40:58.241', '2024-07-08 07:40:58', 'INFORM'),
(136, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 14:41:40.769', 'Đã truy cập ngày:2024-07-08 14:41:40.769', '2024-07-08 07:41:40', 'INFORM'),
(137, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 14:41:52.017', 'Lấy dữ liệu2024-07-08 14:41:52.017', '2024-07-08 07:41:52', 'INFORM'),
(138, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 14:41:54.77', 'Đã truy cập ngày:2024-07-08 14:41:54.77', '2024-07-08 07:41:54', 'INFORM'),
(139, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 14:41:56.885', 'Đã truy cập ngày:2024-07-08 14:41:56.885', '2024-07-08 07:41:56', 'INFORM'),
(140, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 14:42:19.348', 'Đã truy cập ngày:2024-07-08 14:42:19.348', '2024-07-08 07:42:19', 'INFORM'),
(141, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 14:42:20.863', 'Lấy dữ liệu2024-07-08 14:42:20.863', '2024-07-08 07:42:20', 'INFORM'),
(142, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 14:42:38.074', 'Lấy dữ liệu2024-07-08 14:42:38.074', '2024-07-08 07:42:38', 'INFORM'),
(143, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 14:42:40.426', 'Đã truy cập ngày:2024-07-08 14:42:40.426', '2024-07-08 07:42:40', 'INFORM'),
(144, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 14:42:42.747', 'Đã truy cập ngày:2024-07-08 14:42:42.747', '2024-07-08 07:42:42', 'INFORM'),
(145, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:42:48', 'Đã lấy dữ liệu14:42:48', '2024-07-08 07:42:48', 'INFORM'),
(146, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:42:59', 'Đã lấy dữ liệu14:42:59', '2024-07-08 07:42:59', 'INFORM'),
(147, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:43:02', 'Đã lấy dữ liệu14:43:02', '2024-07-08 07:43:02', 'INFORM'),
(148, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:43:03', 'Đã lấy dữ liệu14:43:03', '2024-07-08 07:43:03', 'INFORM'),
(149, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:43:03', 'Đã lấy dữ liệu14:43:03', '2024-07-08 07:43:03', 'INFORM'),
(150, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:43:05', 'Đã lấy dữ liệu14:43:05', '2024-07-08 07:43:05', 'INFORM'),
(151, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:48:24', 'Đã lấy dữ liệu14:48:24', '2024-07-08 07:48:24', 'INFORM'),
(152, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:48:26', 'Đã lấy dữ liệu14:48:26', '2024-07-08 07:48:26', 'INFORM'),
(153, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:48:28', 'Đã lấy dữ liệu14:48:28', '2024-07-08 07:48:28', 'INFORM'),
(154, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:48:30', 'Đã lấy dữ liệu14:48:30', '2024-07-08 07:48:30', 'INFORM'),
(155, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:48:31', 'Đã lấy dữ liệu14:48:31', '2024-07-08 07:48:31', 'INFORM'),
(156, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:48:32', 'Đã lấy dữ liệu14:48:32', '2024-07-08 07:48:32', 'INFORM'),
(157, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:48:32', 'Đã lấy dữ liệu14:48:32', '2024-07-08 07:48:32', 'INFORM'),
(158, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:48:33', 'Đã lấy dữ liệu14:48:33', '2024-07-08 07:48:33', 'INFORM'),
(159, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:52:48', 'Đã lấy dữ liệu14:52:48', '2024-07-08 07:52:48', 'INFORM'),
(160, '0:0:0:0:0:0:0:1', 'Chưa cập nhật14:52:55đơn hàng có id20', 'Đã xóa14:52:55đơn hàng có id20', '2024-07-08 07:52:55', 'DANGER'),
(161, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:52:56', 'Đã lấy dữ liệu14:52:56', '2024-07-08 07:52:56', 'INFORM'),
(162, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:38', 'Đã lấy dữ liệu14:54:38', '2024-07-08 07:54:38', 'INFORM'),
(163, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:39', 'Đã lấy dữ liệu14:54:39', '2024-07-08 07:54:39', 'INFORM'),
(164, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:40', 'Đã lấy dữ liệu14:54:40', '2024-07-08 07:54:40', 'INFORM'),
(165, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:40', 'Đã lấy dữ liệu14:54:40', '2024-07-08 07:54:40', 'INFORM'),
(166, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:41', 'Đã lấy dữ liệu14:54:41', '2024-07-08 07:54:41', 'INFORM'),
(167, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:44', 'Đã lấy dữ liệu14:54:44', '2024-07-08 07:54:44', 'INFORM'),
(168, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:45', 'Đã lấy dữ liệu14:54:45', '2024-07-08 07:54:45', 'INFORM'),
(169, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:46', 'Đã lấy dữ liệu14:54:46', '2024-07-08 07:54:46', 'INFORM'),
(170, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:46', 'Đã lấy dữ liệu14:54:46', '2024-07-08 07:54:46', 'INFORM'),
(171, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:47', 'Đã lấy dữ liệu14:54:47', '2024-07-08 07:54:47', 'INFORM'),
(172, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:47', 'Đã lấy dữ liệu14:54:47', '2024-07-08 07:54:47', 'INFORM'),
(173, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:48', 'Đã lấy dữ liệu14:54:48', '2024-07-08 07:54:48', 'INFORM'),
(174, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:48', 'Đã lấy dữ liệu14:54:48', '2024-07-08 07:54:48', 'INFORM'),
(175, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:48', 'Đã lấy dữ liệu14:54:48', '2024-07-08 07:54:48', 'INFORM'),
(176, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:49', 'Đã lấy dữ liệu14:54:49', '2024-07-08 07:54:49', 'INFORM'),
(177, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:49', 'Đã lấy dữ liệu14:54:49', '2024-07-08 07:54:49', 'INFORM'),
(178, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:49', 'Đã lấy dữ liệu14:54:49', '2024-07-08 07:54:49', 'INFORM'),
(179, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:50', 'Đã lấy dữ liệu14:54:50', '2024-07-08 07:54:50', 'INFORM'),
(180, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:50', 'Đã lấy dữ liệu14:54:50', '2024-07-08 07:54:50', 'INFORM'),
(181, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:51', 'Đã lấy dữ liệu14:54:51', '2024-07-08 07:54:51', 'INFORM'),
(182, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:51', 'Đã lấy dữ liệu14:54:51', '2024-07-08 07:54:51', 'INFORM'),
(183, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:59', 'Đã lấy dữ liệu14:54:59', '2024-07-08 07:54:59', 'INFORM'),
(184, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:59', 'Đã lấy dữ liệu14:54:59', '2024-07-08 07:54:59', 'INFORM'),
(185, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:54:59', 'Đã lấy dữ liệu14:54:59', '2024-07-08 07:54:59', 'INFORM'),
(186, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:55:00', 'Đã lấy dữ liệu14:55:00', '2024-07-08 07:55:00', 'INFORM'),
(187, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu14:55:00', 'Đã lấy dữ liệu14:55:00', '2024-07-08 07:55:00', 'INFORM'),
(188, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:46:49.867', 'Lấy dữ liệu2024-07-08 16:46:49.867', '2024-07-08 09:46:50', 'INFORM'),
(189, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 16:46:59.286', 'Đã truy cập ngày:2024-07-08 16:46:59.286', '2024-07-08 09:46:59', 'INFORM'),
(190, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:47:06.866', 'Lấy dữ liệu2024-07-08 16:47:06.866', '2024-07-08 09:47:06', 'INFORM'),
(191, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:47:10.886', 'Lấy dữ liệu2024-07-08 16:47:10.886', '2024-07-08 09:47:10', 'INFORM'),
(192, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 16:47:17.532', 'Đã truy cập ngày:2024-07-08 16:47:17.532', '2024-07-08 09:47:17', 'INFORM'),
(193, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:21', 'Đã lấy dữ liệu16:47:21', '2024-07-08 09:47:21', 'INFORM'),
(194, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:30', 'Đã lấy dữ liệu16:47:30', '2024-07-08 09:47:30', 'INFORM'),
(195, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:31', 'Đã lấy dữ liệu16:47:31', '2024-07-08 09:47:31', 'INFORM'),
(196, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:31', 'Đã lấy dữ liệu16:47:31', '2024-07-08 09:47:31', 'INFORM'),
(197, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:36', 'Đã lấy dữ liệu16:47:36', '2024-07-08 09:47:36', 'INFORM'),
(198, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:39', 'Đã lấy dữ liệu16:47:39', '2024-07-08 09:47:39', 'INFORM'),
(199, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:40', 'Đã lấy dữ liệu16:47:40', '2024-07-08 09:47:40', 'INFORM'),
(200, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:44', 'Đã lấy dữ liệu16:47:44', '2024-07-08 09:47:44', 'INFORM'),
(201, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:44', 'Đã lấy dữ liệu16:47:44', '2024-07-08 09:47:44', 'INFORM'),
(202, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:45', 'Đã lấy dữ liệu16:47:45', '2024-07-08 09:47:45', 'INFORM'),
(203, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:45', 'Đã lấy dữ liệu16:47:45', '2024-07-08 09:47:45', 'INFORM'),
(204, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:47', 'Đã lấy dữ liệu16:47:47', '2024-07-08 09:47:47', 'INFORM'),
(205, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:48', 'Đã lấy dữ liệu16:47:48', '2024-07-08 09:47:48', 'INFORM'),
(206, '0:0:0:0:0:0:0:1', 'Chưa cập nhật16:47:54đơn hàng có id20', 'Đã xóa16:47:54đơn hàng có id20', '2024-07-08 09:47:54', 'DANGER'),
(207, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:47:56', 'Đã lấy dữ liệu16:47:56', '2024-07-08 09:47:56', 'INFORM'),
(208, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:48:06', 'Đã lấy dữ liệu16:48:06', '2024-07-08 09:48:06', 'INFORM'),
(209, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:48:07', 'Đã lấy dữ liệu16:48:07', '2024-07-08 09:48:07', 'INFORM'),
(210, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:48:09', 'Đã lấy dữ liệu16:48:09', '2024-07-08 09:48:09', 'INFORM'),
(211, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:48:10', 'Đã lấy dữ liệu16:48:10', '2024-07-08 09:48:10', 'INFORM'),
(212, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 16:49:19.686', 'Đã truy cập ngày:2024-07-08 16:49:19.686', '2024-07-08 09:49:19', 'INFORM'),
(213, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 16:49:20.47', 'Đã truy cập ngày:2024-07-08 16:49:20.47', '2024-07-08 09:49:20', 'INFORM'),
(214, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:49:22.628', 'Lấy dữ liệu2024-07-08 16:49:22.628', '2024-07-08 09:49:22', 'INFORM'),
(215, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 16:49:25.435', 'Đã truy cập ngày:2024-07-08 16:49:25.435', '2024-07-08 09:49:25', 'INFORM'),
(216, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:49:27.197', 'Lấy dữ liệu2024-07-08 16:49:27.197', '2024-07-08 09:49:27', 'INFORM'),
(217, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-08 16:49:27.61', 'Đã truy cập ngày:2024-07-08 16:49:27.61', '2024-07-08 09:49:27', 'INFORM'),
(218, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:49:45', 'Đã lấy dữ liệu16:49:45', '2024-07-08 09:49:45', 'INFORM'),
(219, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:49:45', 'Đã lấy dữ liệu16:49:45', '2024-07-08 09:49:45', 'INFORM'),
(220, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:49:46', 'Đã lấy dữ liệu16:49:46', '2024-07-08 09:49:46', 'INFORM'),
(221, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:49:46', 'Đã lấy dữ liệu16:49:46', '2024-07-08 09:49:46', 'INFORM'),
(222, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:49:47', 'Đã lấy dữ liệu16:49:47', '2024-07-08 09:49:47', 'INFORM'),
(223, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:49:47.98', 'Lấy dữ liệu2024-07-08 16:49:47.981', '2024-07-08 09:49:47', 'INFORM'),
(224, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:49:50.815', 'Lấy dữ liệu2024-07-08 16:49:50.815', '2024-07-08 09:49:50', 'INFORM'),
(225, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:49:54.72', 'Lấy dữ liệu2024-07-08 16:49:54.72', '2024-07-08 09:49:54', 'INFORM'),
(226, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:49:56.46', 'Lấy dữ liệu2024-07-08 16:49:56.46', '2024-07-08 09:49:56', 'INFORM'),
(227, '0:0:0:0:0:0:0:1', 'User có id là:27chưa thay đổi role', 'User có id là:27đã thay đổi roleprohibit', '2024-07-08 09:50:02', 'DANGER'),
(228, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:50:08.638', 'Lấy dữ liệu2024-07-08 16:50:08.638', '2024-07-08 09:50:08', 'INFORM'),
(229, '0:0:0:0:0:0:0:1', 'User có id là:27chưa thay đổi role', 'User có id là:27đã thay đổi roleuser', '2024-07-08 09:50:24', 'DANGER'),
(230, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:50:26.635', 'Lấy dữ liệu2024-07-08 16:50:26.635', '2024-07-08 09:50:26', 'INFORM'),
(231, '0:0:0:0:0:0:0:1', 'User có id là:16chưa thay đổi role', 'User có id là:16đã thay đổi roleuser', '2024-07-08 09:50:31', 'DANGER'),
(232, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-08 16:50:34.089', 'Lấy dữ liệu2024-07-08 16:50:34.089', '2024-07-08 09:50:34', 'INFORM'),
(233, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-09 08:26:33.246', 'Đã truy cập ngày:2024-07-09 08:26:33.246', '2024-07-09 01:26:33', 'INFORM'),
(234, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-09 08:26:37.394', 'Đã truy cập ngày:2024-07-09 08:26:37.394', '2024-07-09 01:26:37', 'INFORM'),
(235, '0:0:0:0:0:0:0:1', 'Chưa  cập nhật thành công sản phẩm có id:272024-07-09 08:26:48.604', 'Đã cập nhật thành công sản phẩm có id:272024-07-09 08:26:48.604', '2024-07-09 01:26:48', 'DANGER'),
(236, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-09 08:26:51.823', 'Đã truy cập ngày:2024-07-09 08:26:51.823', '2024-07-09 01:26:51', 'INFORM'),
(237, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:29:30', 'Đã lấy dữ liệu08:29:30', '2024-07-09 01:29:30', 'INFORM'),
(238, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:30:43', 'Đã lấy dữ liệu08:30:43', '2024-07-09 01:30:43', 'INFORM'),
(239, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:30:47', 'Đã lấy dữ liệu08:30:47', '2024-07-09 01:30:47', 'INFORM'),
(240, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:30:47', 'Đã lấy dữ liệu08:30:47', '2024-07-09 01:30:47', 'INFORM'),
(241, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:30:48', 'Đã lấy dữ liệu08:30:48', '2024-07-09 01:30:48', 'INFORM'),
(242, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:30:48', 'Đã lấy dữ liệu08:30:48', '2024-07-09 01:30:48', 'INFORM'),
(243, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:30:49', 'Đã lấy dữ liệu08:30:49', '2024-07-09 01:30:49', 'INFORM'),
(244, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:30:49', 'Đã lấy dữ liệu08:30:49', '2024-07-09 01:30:49', 'INFORM'),
(245, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:30:50', 'Đã lấy dữ liệu08:30:50', '2024-07-09 01:30:50', 'INFORM'),
(246, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu08:30:50', 'Đã lấy dữ liệu08:30:50', '2024-07-09 01:30:50', 'INFORM'),
(247, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-09 08:30:59.083', 'Đã truy cập ngày:2024-07-09 08:30:59.083', '2024-07-09 01:30:59', 'INFORM'),
(248, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-09 08:31:01.925', 'Đã truy cập ngày:2024-07-09 08:31:01.925', '2024-07-09 01:31:01', 'INFORM'),
(249, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-09 08:31:04.609', 'Đã truy cập ngày:2024-07-09 08:31:04.609', '2024-07-09 01:31:04', 'INFORM'),
(250, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-09 08:32:25.996', 'Đã truy cập ngày:2024-07-09 08:32:25.996', '2024-07-09 01:32:26', 'INFORM'),
(251, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-09 08:33:36.183', 'Đã truy cập ngày:2024-07-09 08:33:36.183', '2024-07-09 01:33:36', 'INFORM'),
(252, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-09 08:33:38.407', 'Lấy dữ liệu2024-07-09 08:33:38.407', '2024-07-09 01:33:38', 'INFORM'),
(253, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-09 08:37:49.083', 'Đã truy cập ngày:2024-07-09 08:37:49.083', '2024-07-09 01:37:49', 'INFORM'),
(254, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-09 08:37:50.15', 'Lấy dữ liệu2024-07-09 08:37:50.15', '2024-07-09 01:37:50', 'INFORM'),
(255, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:19:03.106', 'Đã truy cập ngày:2024-07-10 11:19:03.106', '2024-07-10 04:19:03', 'INFORM'),
(256, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:19:08.57sản phẩm có id26', 'Đã xóa  ngày:2024-07-10 11:19:08.572sản phẩm có id26', '2024-07-10 04:19:08', 'DANGER'),
(257, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:19:10.842', 'Đã truy cập ngày:2024-07-10 11:19:10.842', '2024-07-10 04:19:10', 'INFORM'),
(258, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:21:16.634sản phẩm có id28', 'Đã xóa  ngày:2024-07-10 11:21:16.634sản phẩm có id28', '2024-07-10 04:21:16', 'DANGER'),
(259, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:21:18.864', 'Đã truy cập ngày:2024-07-10 11:21:18.864', '2024-07-10 04:21:18', 'INFORM'),
(260, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:23:58.429', 'Đã truy cập ngày:2024-07-10 11:23:58.429', '2024-07-10 04:23:58', 'INFORM'),
(261, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:24:01.296sản phẩm có id27', 'Đã xóa  ngày:2024-07-10 11:24:01.296sản phẩm có id27', '2024-07-10 04:24:01', 'DANGER'),
(262, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:24:03.416', 'Đã truy cập ngày:2024-07-10 11:24:03.416', '2024-07-10 04:24:03', 'INFORM'),
(263, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:29:22.412', 'Đã truy cập ngày:2024-07-10 11:29:22.412', '2024-07-10 04:29:22', 'INFORM'),
(264, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:29:25.058sản phẩm có id29', 'Đã xóa  ngày:2024-07-10 11:29:25.058sản phẩm có id29', '2024-07-10 04:29:25', 'DANGER'),
(265, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:30:14.491', 'Đã truy cập ngày:2024-07-10 11:30:14.491', '2024-07-10 04:30:14', 'INFORM'),
(266, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:30:16.589sản phẩm có id30', 'Đã xóa  ngày:2024-07-10 11:30:16.59sản phẩm có id30', '2024-07-10 04:30:16', 'DANGER'),
(267, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:30:18.65', 'Đã truy cập ngày:2024-07-10 11:30:18.65', '2024-07-10 04:30:18', 'INFORM'),
(268, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:30:58.667sản phẩm có id31', 'Đã xóa  ngày:2024-07-10 11:30:58.667sản phẩm có id31', '2024-07-10 04:30:58', 'DANGER'),
(269, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:31:12.919sản phẩm có id32', 'Đã xóa  ngày:2024-07-10 11:31:12.919sản phẩm có id32', '2024-07-10 04:31:12', 'DANGER'),
(270, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:31:27.398sản phẩm có id31', 'Đã xóa  ngày:2024-07-10 11:31:27.398sản phẩm có id31', '2024-07-10 04:31:27', 'DANGER'),
(271, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:31:30.924sản phẩm có id32', 'Đã xóa  ngày:2024-07-10 11:31:30.924sản phẩm có id32', '2024-07-10 04:31:30', 'DANGER'),
(272, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:31:37.804sản phẩm có id33', 'Đã xóa  ngày:2024-07-10 11:31:37.804sản phẩm có id33', '2024-07-10 04:31:37', 'DANGER'),
(273, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:31:41.679sản phẩm có id43', 'Đã xóa  ngày:2024-07-10 11:31:41.679sản phẩm có id43', '2024-07-10 04:31:41', 'DANGER'),
(274, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:32:04.683sản phẩm có id43', 'Đã xóa  ngày:2024-07-10 11:32:04.683sản phẩm có id43', '2024-07-10 04:32:04', 'DANGER'),
(275, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:32:08.44sản phẩm có id44', 'Đã xóa  ngày:2024-07-10 11:32:08.44sản phẩm có id44', '2024-07-10 04:32:08', 'DANGER'),
(276, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:33:11.488', 'Đã truy cập ngày:2024-07-10 11:33:11.488', '2024-07-10 04:33:11', 'INFORM'),
(277, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 11:33:14.754', 'Đã truy cập ngày:2024-07-10 11:33:14.754', '2024-07-10 04:33:14', 'INFORM'),
(278, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:33:17.522sản phẩm có id34', 'Đã xóa  ngày:2024-07-10 11:33:17.523sản phẩm có id34', '2024-07-10 04:33:17', 'DANGER'),
(279, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 11:33:29.348sản phẩm có id36', 'Đã xóa  ngày:2024-07-10 11:33:29.348sản phẩm có id36', '2024-07-10 04:33:29', 'DANGER'),
(280, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:00:31.041', 'Đã truy cập ngày:2024-07-10 15:00:31.041', '2024-07-10 08:00:31', 'INFORM'),
(281, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:00:49.11sản phẩm có id1', 'Đã xóa  ngày:2024-07-10 15:00:49.111sản phẩm có id1', '2024-07-10 08:00:49', 'DANGER'),
(282, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:00:51.068', 'Đã truy cập ngày:2024-07-10 15:00:51.068', '2024-07-10 08:00:51', 'INFORM'),
(283, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:02:08.53', 'Đã truy cập ngày:2024-07-10 15:02:08.53', '2024-07-10 08:02:11', 'INFORM'),
(284, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:04:30.536', 'Đã truy cập ngày:2024-07-10 15:04:30.536', '2024-07-10 08:04:30', 'INFORM'),
(285, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:04:42.891sản phẩm có id26', 'Đã xóa  ngày:2024-07-10 15:04:43.715sản phẩm có id26', '2024-07-10 08:04:44', 'DANGER'),
(286, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:20:51.166', 'Đã truy cập ngày:2024-07-10 15:20:51.167', '2024-07-10 08:20:51', 'INFORM'),
(287, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:20:53.886sản phẩm có id2', 'Đã xóa  ngày:2024-07-10 15:20:53.887sản phẩm có id2', '2024-07-10 08:20:53', 'DANGER'),
(288, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:20:55.989', 'Đã truy cập ngày:2024-07-10 15:20:55.989', '2024-07-10 08:20:55', 'INFORM'),
(289, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:21:11.897sản phẩm có id27', 'Đã xóa  ngày:2024-07-10 15:21:11.897sản phẩm có id27', '2024-07-10 08:21:11', 'DANGER'),
(290, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:23:34.201', 'Đã truy cập ngày:2024-07-10 15:23:34.201', '2024-07-10 08:23:34', 'INFORM'),
(291, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:23:48.739sản phẩm có id30', 'Đã xóa  ngày:2024-07-10 15:23:49.817sản phẩm có id30', '2024-07-10 08:23:53', 'DANGER'),
(292, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:27:38.247sản phẩm có id58', 'Đã xóa  ngày:2024-07-10 15:27:38.247sản phẩm có id58', '2024-07-10 08:27:38', 'DANGER'),
(293, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:27:51.816', 'Đã truy cập ngày:2024-07-10 15:27:51.816', '2024-07-10 08:27:52', 'INFORM'),
(294, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:28:22.394sản phẩm có id31', 'Đã xóa  ngày:2024-07-10 15:28:22.396sản phẩm có id31', '2024-07-10 08:28:22', 'DANGER'),
(295, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:28:28.42sản phẩm có id69', 'Đã xóa  ngày:2024-07-10 15:28:28.42sản phẩm có id69', '2024-07-10 08:28:28', 'DANGER'),
(296, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:28:58.644sản phẩm có id16', 'Đã xóa  ngày:2024-07-10 15:28:58.644sản phẩm có id16', '2024-07-10 08:28:58', 'DANGER'),
(297, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:34:36.65sản phẩm có id17', 'Đã xóa  ngày:2024-07-10 15:34:36.65sản phẩm có id17', '2024-07-10 08:34:36', 'DANGER'),
(298, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:36:07.527', 'Đã truy cập ngày:2024-07-10 15:36:07.527', '2024-07-10 08:36:07', 'INFORM'),
(299, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:36:18.627sản phẩm có id20', 'Đã xóa  ngày:2024-07-10 15:36:19.686sản phẩm có id20', '2024-07-10 08:36:24', 'DANGER'),
(300, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-10 15:39:17.395', 'Lấy dữ liệu2024-07-10 15:39:17.395', '2024-07-10 08:39:17', 'INFORM'),
(301, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-10 15:39:30.959', 'Lấy dữ liệu2024-07-10 15:39:30.96', '2024-07-10 08:39:31', 'INFORM'),
(302, '0:0:0:0:0:0:0:1', 'User có id là:27chưa xóa', 'Đã xóa27', '2024-07-10 08:39:34', 'DANGER'),
(303, '0:0:0:0:0:0:0:1', 'User có id là:16chưa xóa', 'Đã xóa16', '2024-07-10 08:39:42', 'DANGER'),
(304, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu15:39:52', 'Đã lấy dữ liệu15:39:52', '2024-07-10 08:39:52', 'INFORM'),
(305, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu15:39:52', 'Đã lấy dữ liệu15:39:52', '2024-07-10 08:39:52', 'INFORM'),
(306, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu15:39:53', 'Đã lấy dữ liệu15:39:53', '2024-07-10 08:39:53', 'INFORM'),
(307, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu15:39:53', 'Đã lấy dữ liệu15:39:53', '2024-07-10 08:39:53', 'INFORM'),
(308, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu15:39:53', 'Đã lấy dữ liệu15:39:53', '2024-07-10 08:39:53', 'INFORM'),
(309, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu15:39:54', 'Đã lấy dữ liệu15:39:54', '2024-07-10 08:39:54', 'INFORM'),
(310, '0:0:0:0:0:0:0:1', 'Chưa cập nhật15:39:58đơn hàng có id17', 'Đã xóa15:39:58đơn hàng có id17', '2024-07-10 08:39:58', 'DANGER'),
(311, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-10 15:40:01.512', 'Lấy dữ liệu2024-07-10 15:40:01.512', '2024-07-10 08:40:01', 'INFORM'),
(312, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:40:06.216', 'Đã truy cập ngày:2024-07-10 15:40:06.216', '2024-07-10 08:40:06', 'INFORM'),
(313, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:41:27.753', 'Đã truy cập ngày:2024-07-10 15:41:27.753', '2024-07-10 08:41:27', 'INFORM'),
(314, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:41:32.451sản phẩm có id29', 'Đã xóa  ngày:2024-07-10 15:41:32.451sản phẩm có id29', '2024-07-10 08:41:32', 'DANGER'),
(315, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:43:33.665', 'Đã truy cập ngày:2024-07-10 15:43:33.665', '2024-07-10 08:43:33', 'INFORM'),
(316, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:43:36.937sản phẩm có id3', 'Đã xóa  ngày:2024-07-10 15:43:36.937sản phẩm có id3', '2024-07-10 08:43:36', 'DANGER'),
(317, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:43:39.371', 'Đã truy cập ngày:2024-07-10 15:43:39.371', '2024-07-10 08:43:39', 'INFORM'),
(318, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:43:47.642sản phẩm có id60', 'Đã xóa  ngày:2024-07-10 15:43:47.642sản phẩm có id60', '2024-07-10 08:43:47', 'DANGER'),
(319, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:43:57.498sản phẩm có id74', 'Đã xóa  ngày:2024-07-10 15:43:57.498sản phẩm có id74', '2024-07-10 08:43:57', 'DANGER'),
(320, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:45:10.232', 'Đã truy cập ngày:2024-07-10 15:45:10.232', '2024-07-10 08:45:10', 'INFORM'),
(321, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:45:19.502sản phẩm có id75', 'Đã xóa  ngày:2024-07-10 15:45:19.502sản phẩm có id75', '2024-07-10 08:45:19', 'DANGER'),
(322, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:47:08.949', 'Đã truy cập ngày:2024-07-10 15:47:08.949', '2024-07-10 08:47:09', 'INFORM'),
(323, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:47:13.831sản phẩm có id4', 'Đã xóa  ngày:2024-07-10 15:47:13.831sản phẩm có id4', '2024-07-10 08:47:13', 'DANGER'),
(324, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:47:26.338sản phẩm có id5', 'Đã xóa  ngày:2024-07-10 15:47:26.338sản phẩm có id5', '2024-07-10 08:47:26', 'DANGER'),
(325, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:47:33.011sản phẩm có id6', 'Đã xóa  ngày:2024-07-10 15:47:33.011sản phẩm có id6', '2024-07-10 08:47:33', 'DANGER'),
(326, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:47:36.185sản phẩm có id12', 'Đã xóa  ngày:2024-07-10 15:47:36.185sản phẩm có id12', '2024-07-10 08:47:36', 'DANGER'),
(327, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:47:39.651sản phẩm có id36', 'Đã xóa  ngày:2024-07-10 15:47:39.651sản phẩm có id36', '2024-07-10 08:47:39', 'DANGER'),
(328, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:47:42.696sản phẩm có id45', 'Đã xóa  ngày:2024-07-10 15:47:42.696sản phẩm có id45', '2024-07-10 08:47:42', 'DANGER'),
(329, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:47:47.25sản phẩm có id85', 'Đã xóa  ngày:2024-07-10 15:47:47.25sản phẩm có id85', '2024-07-10 08:47:47', 'DANGER'),
(330, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:47:50.099sản phẩm có id96', 'Đã xóa  ngày:2024-07-10 15:47:50.1sản phẩm có id96', '2024-07-10 08:47:50', 'DANGER'),
(331, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-10 15:47:58.931sản phẩm có id90', 'Đã xóa  ngày:2024-07-10 15:47:58.931sản phẩm có id90', '2024-07-10 08:47:58', 'DANGER'),
(332, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:48:01.033', 'Đã truy cập ngày:2024-07-10 15:48:01.033', '2024-07-10 08:48:01', 'INFORM'),
(333, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:50:56.581', 'Đã truy cập ngày:2024-07-10 15:50:56.581', '2024-07-10 08:50:56', 'INFORM'),
(334, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-10 15:50:59.625', 'Lấy dữ liệu2024-07-10 15:50:59.625', '2024-07-10 08:50:59', 'INFORM'),
(335, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-10 15:52:17.924', 'Lấy dữ liệu2024-07-10 15:52:17.924', '2024-07-10 08:52:18', 'INFORM'),
(336, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-10 15:53:42.497', 'Lấy dữ liệu2024-07-10 15:53:42.497', '2024-07-10 08:53:42', 'INFORM'),
(337, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 15:53:51.559', 'Đã truy cập ngày:2024-07-10 15:53:51.559', '2024-07-10 08:53:51', 'INFORM'),
(338, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-10 15:54:37.413', 'Lấy dữ liệu2024-07-10 15:54:37.413', '2024-07-10 08:54:37', 'INFORM'),
(339, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-10 16:01:37.147', 'Đã truy cập ngày:2024-07-10 16:01:37.147', '2024-07-10 09:01:37', 'INFORM'),
(340, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-10 16:01:43.061', 'Lấy dữ liệu2024-07-10 16:01:43.061', '2024-07-10 09:01:43', 'INFORM'),
(341, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-10 16:07:12.834', 'Lấy dữ liệu2024-07-10 16:07:12.834', '2024-07-10 09:07:12', 'INFORM'),
(342, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:19', 'Đã lấy dữ liệu16:07:19', '2024-07-10 09:07:19', 'INFORM'),
(343, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:20', 'Đã lấy dữ liệu16:07:20', '2024-07-10 09:07:20', 'INFORM'),
(344, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:20', 'Đã lấy dữ liệu16:07:20', '2024-07-10 09:07:20', 'INFORM'),
(345, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:21', 'Đã lấy dữ liệu16:07:21', '2024-07-10 09:07:21', 'INFORM'),
(346, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:21', 'Đã lấy dữ liệu16:07:21', '2024-07-10 09:07:21', 'INFORM'),
(347, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:27', 'Đã lấy dữ liệu16:07:27', '2024-07-10 09:07:27', 'INFORM'),
(348, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:27', 'Đã lấy dữ liệu16:07:27', '2024-07-10 09:07:27', 'INFORM'),
(349, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:28', 'Đã lấy dữ liệu16:07:28', '2024-07-10 09:07:28', 'INFORM'),
(350, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:28', 'Đã lấy dữ liệu16:07:28', '2024-07-10 09:07:28', 'INFORM'),
(351, '0:0:0:0:0:0:0:1', 'Chưa lấy dữ liệu16:07:28', 'Đã lấy dữ liệu16:07:28', '2024-07-10 09:07:28', 'INFORM'),
(352, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-11 09:32:56.892', 'Đã truy cập ngày:2024-07-11 09:32:56.892', '2024-07-11 02:32:57', 'INFORM'),
(353, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-11 09:33:05.331sản phẩm có id9', 'Đã xóa  ngày:2024-07-11 09:33:05.332sản phẩm có id9', '2024-07-11 02:33:05', 'DANGER'),
(354, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-11 09:33:08.346', 'Đã truy cập ngày:2024-07-11 09:33:08.346', '2024-07-11 02:33:08', 'INFORM'),
(355, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-11 09:33:13.624sản phẩm có id8', 'Đã xóa  ngày:2024-07-11 09:33:13.624sản phẩm có id8', '2024-07-11 02:33:13', 'DANGER'),
(356, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-11 09:34:04.294', 'Đã truy cập ngày:2024-07-11 09:34:04.294', '2024-07-11 02:34:04', 'INFORM'),
(357, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-11 09:34:07.145sản phẩm có id10', 'Đã xóa  ngày:2024-07-11 09:34:07.145sản phẩm có id10', '2024-07-11 02:34:07', 'DANGER'),
(358, '0:0:0:0:0:0:0:1', 'Chưa xóa ngày2024-07-11 09:34:10.664sản phẩm có id7', 'Đã xóa  ngày:2024-07-11 09:34:10.664sản phẩm có id7', '2024-07-11 02:34:10', 'DANGER'),
(359, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-11 09:34:28.398', 'Đã truy cập ngày:2024-07-11 09:34:28.398', '2024-07-11 02:34:28', 'INFORM'),
(360, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-11 18:46:16.925', 'Lấy dữ liệu2024-07-11 18:46:16.925', '2024-07-11 11:46:17', 'INFORM'),
(361, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-07-11 18:47:42.394', '2024-07-11 11:47:42', 'ALERT'),
(362, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-07-11 18:49:58.064', '2024-07-11 11:49:58', 'ALERT'),
(363, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-07-11 18:52:40.182', '2024-07-11 11:52:40', 'ALERT'),
(364, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-11 19:17:13.748', 'Lấy dữ liệu2024-07-11 19:17:13.748', '2024-07-11 12:17:13', 'INFORM'),
(365, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-11 19:17:15.892', 'Đã truy cập ngày:2024-07-11 19:17:15.892', '2024-07-11 12:17:15', 'INFORM'),
(366, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-07-11 19:18:56.472', '2024-07-11 12:18:56', 'ALERT'),
(367, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-11 21:25:19.009', 'Lấy dữ liệu2024-07-11 21:25:19.009', '2024-07-11 14:25:19', 'INFORM'),
(368, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-07-11 21:26:26.993', '2024-07-11 14:26:26', 'ALERT'),
(369, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-11 21:33:31.784', 'Lấy dữ liệu2024-07-11 21:33:31.784', '2024-07-11 14:33:32', 'INFORM'),
(370, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-07-11 21:36:11.726', '2024-07-11 14:36:13', 'ALERT'),
(371, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-07-11 21:42:24.605', '2024-07-11 14:42:30', 'ALERT'),
(372, '0:0:0:0:0:0:0:1', 'Chưa có dữ liệu2024-07-11 21:51:00.188', 'Lấy dữ liệu2024-07-11 21:51:00.188', '2024-07-11 14:51:00', 'INFORM'),
(373, '0:0:0:0:0:0:0:1', 'Chưa truy cập ngày2024-07-11 21:51:02.812', 'Đã truy cập ngày:2024-07-11 21:51:02.812', '2024-07-11 14:51:02', 'INFORM'),
(374, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-07-11 21:51:55.595', '2024-07-11 14:51:55', 'ALERT'),
(375, '0:0:0:0:0:0:0:1', 'Chưa thêm dữ liệu', 'Đã thêm sản phẩm thảnh công2024-07-11 21:52:31.137', '2024-07-11 14:52:31', 'ALERT');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT NULL,
  `total_price` float DEFAULT NULL,
  `status` enum('chờ xác nhận','chờ giao','đang giao','đã giao','hủy') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `statusPayment` varchar(50) NOT NULL DEFAULT '',
  `typeShip` enum('ship','Pick up at the shop') DEFAULT NULL,
  `address` varchar(200) DEFAULT NULL,
  `shipCost` float DEFAULT NULL,
  `TypePayment` varchar(50) NOT NULL DEFAULT '',
  `note` varchar(500) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `orders`
--

INSERT INTO `orders` (`id`, `created_at`, `updated_at`, `total_price`, `status`, `user_id`, `statusPayment`, `typeShip`, `address`, `shipCost`, `TypePayment`, `note`) VALUES
(1, '2024-07-07 19:33:27', NULL, 180000, 'đang giao', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 0, 'tien mat', 'giao cho sếp lớn'),
(11, '2024-07-07 20:30:38', NULL, 4980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(12, '2024-07-07 20:31:35', NULL, 4980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(14, '2024-07-07 20:44:55', NULL, 4980000, 'chờ xác nhận', 27, 'chua thanh toan', 'ship', 'mach thi lieu', 20000, 'chuyen khoan', 'giao cho sếp lớn'),
(15, '2024-07-07 21:00:12', NULL, 39980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(16, '2024-07-07 21:03:57', NULL, 19980000, 'đã giao', 27, 'chua thanh toan', 'ship', 'mach thi lieu', 20000, 'chuyen khoan', 'giao cho sếp lớn'),
(17, '2024-07-08 08:25:16', NULL, 9980000, 'đang giao', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(18, '2024-07-08 08:39:14', NULL, 9980000, 'hủy', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(19, '2024-07-08 08:39:45', NULL, 9980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(20, '2024-07-08 08:40:11', NULL, 9980000, 'hủy', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(21, '2024-07-08 08:40:19', NULL, 9980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(22, '2024-07-08 08:42:28', NULL, 9980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(23, '2024-07-08 08:42:38', NULL, 9980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(24, '2024-07-08 08:42:47', NULL, 9980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(25, '2024-07-08 08:43:13', NULL, 9980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(26, '2024-07-08 09:31:03', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(27, '2024-07-08 09:31:28', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(28, '2024-07-08 09:31:35', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(29, '2024-07-08 09:40:56', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(30, '2024-07-08 09:41:58', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(31, '2024-07-08 09:42:12', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(32, '2024-07-08 09:42:33', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(33, '2024-07-08 09:43:21', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(34, '2024-07-08 09:43:49', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(35, '2024-07-08 09:44:08', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(36, '2024-07-08 09:58:13', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(37, '2024-07-08 09:58:38', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(38, '2024-07-08 10:03:12', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(39, '2024-07-08 10:04:04', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn'),
(40, '2024-07-08 10:08:04', NULL, 19980000, 'chờ xác nhận', 27, 'chua thanh toan', 'Pick up at the shop', 'mach thi lieu', 20000, 'tien mat', 'giao cho sếp lớn');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `order_details`
--

CREATE TABLE `order_details` (
  `order_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `quantity_total` double NOT NULL DEFAULT 0,
  `total_price` double NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `order_details`
--

INSERT INTO `order_details` (`order_id`, `product_id`, `quantity_total`, `total_price`) VALUES
(1, 4, 1, 200000),
(16, 3, 1, 10000000),
(16, 1, 2, 10000000),
(17, 1, 2, 10000000),
(18, 1, 2, 10000000),
(19, 1, 2, 10000000),
(20, 1, 2, 10000000),
(21, 1, 2, 10000000),
(22, 1, 2, 10000000),
(23, 1, 2, 10000000),
(24, 1, 2, 10000000),
(25, 1, 2, 10000000),
(26, 1, 4, 20000000),
(27, 1, 4, 20000000),
(28, 1, 4, 20000000),
(29, 1, 4, 20000000),
(30, 1, 4, 20000000),
(31, 1, 4, 20000000),
(32, 1, 4, 20000000),
(33, 1, 4, 20000000),
(34, 1, 4, 20000000),
(35, 1, 4, 20000000),
(36, 1, 4, 20000000),
(37, 1, 4, 20000000),
(38, 1, 4, 20000000),
(39, 1, 4, 20000000),
(40, 1, 4, 20000000);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `category_id` int(11) DEFAULT NULL,
  `product_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `price` float DEFAULT NULL,
  `status` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `sale` int(11) DEFAULT 0,
  `hot` tinyint(1) DEFAULT 0,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `information` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT NULL,
  `deleted_at` datetime DEFAULT NULL,
  `image_product` int(11) DEFAULT NULL,
  `status_deleted` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `products`
--

INSERT INTO `products` (`id`, `category_id`, `product_name`, `price`, `status`, `sale`, `hot`, `description`, `information`, `created_at`, `updated_at`, `deleted_at`, `image_product`, `status_deleted`) VALUES
(1, 1, 'Đá Ruby cacbon tự nhiên', 5000000, 'còn hàng', 4500000, 1, '', '/gia tri:dep/', '2024-04-23 19:26:37', '2024-04-03 19:28:13', '2024-04-01 19:28:17', 1, 'đã xóa'),
(2, 1, 'Đá Ruby chất kính trong', 5000000, 'còn hàng', 4500000, 1, '', '0', '2024-04-04 19:26:37', '2024-04-03 19:28:20', '2024-04-03 19:28:22', 2, 'đã xóa'),
(3, 6, 'Aquamarine xanh biển tự nhiên', 10000000, 'còn hàng', 9000000, 1, '', '0', '2024-04-29 19:26:37', '2024-04-01 19:28:26', '2024-04-03 19:28:29', 3, 'đã xóa'),
(4, 6, 'Aquamarine xanh biển chiều ', 9800000, 'còn hàng', 9500000, 1, '', '0', '2024-04-29 19:26:37', '2024-04-09 19:28:32', '2024-04-24 19:28:37', 4, 'đã xóa'),
(5, 3, 'Tourmaline cắt giác emerald tự nhiên', 4000000, 'còn hàng', 3500000, 1, '', '0', '2024-04-12 19:26:37', '2024-04-01 19:28:40', '2024-04-17 19:28:44', 5, 'đã xóa'),
(6, 10, 'Viên Topaz trắng tinh khiết 3,88ct – IRTP57 2311388', 5820000, 'còn hàng', 300000, 1, 'Đá Topaz tự nhiên sở hữu vẻ đẹp tự nhiên nguyên bản, độ tinh khiết cao rất phù hợp lên nhẫn nữ. Giác cắt Round - Facet hiện đại đảm bảo cho thiết kế của bạn luôn rực rỡ và thu hút ở bất cứ hoàn cảnh xuất hiện nào. ', '/color:trắng,weight:3,88ct,size:10,1 - 6,2mm,opacity:trắng trong,cutting_form:Hình khối round - facet/', '2024-04-26 15:48:59', '2024-04-26 15:48:59', NULL, 101, 'đã xóa'),
(7, 10, 'Viên Topaz màu trắng tinh khiết tự nhiên 100% 2,26ct – IRTP 237226', 3164000, 'còn hàng', 300000, 1, 'Đá Topaz không chỉ là món trang sức đá màu đặc biệt mà nó còn mang nhiều ý nghĩa về phong thủy và sức khỏe. Với đa dạng giá trị như vậy, loại đá này đã được nhiều người săn đón trên thị trường.', '/color:trắng,weight:2,26ct,size:7,4 - 7,1 - 5,3mm,opacity:Sạch tinh bằng mắt thường,cutting_form:Cắt khối Emerald tiêu chuẩn./', '2024-04-26 15:50:26', '2024-04-26 15:50:26', NULL, 64, 'đã xóa'),
(8, 6, 'Tinh thể Aquamarine màu xanh lam 6,63g – IRAQ 236663\n', 5000000, 'háº¿t hÃ ng', 500000, 1, 'Tinh thể aquamarine là khoáng vật nằm trong nhóm Beryl có màu sắc xanh lam. Trong đó, loại màu xanh lam,được hình thành trong tự nhiên qua quá trình chuyển hóa của các vật chất tự nhiên. Chúng thường nằm sâu trong lòng đất và tích tụ rất nhiều năng lượng của vũ trụ.', '/color:xanh lam,weight:6,63g,size:4,4 - 1,1cm,opacity:trong suốt,cutting_form:chưa xác định/', '2024-04-26 15:52:55', '2024-04-26 15:52:55', NULL, 77, 'đã xóa'),
(9, 2, 'Đá Sapphire cháo đồng An Phú Lục Yên 1,22ct – IRSP217 2404122', 33600000, 'còn hàng', 500000, 1, 'Sapphire màu cháo đồng tự nhiên, xuất xứ: Lục Yên. Trọng lượng: 1,22ct, hình khối heart - facet. Độ tinh khiết cao, lành sạch 99%. Phù hợp lên mẫu nhẫn, mặt dây chuyền.', '/color:hồng,weight:1,22ct,size:5,9 x 6,8 - 4mm,opacity:Độ chiếu toàn viên, đủ đáy,cutting_form:Heart - facet/', '2024-04-26 15:52:55', '2024-04-26 15:52:55', NULL, 1, 'đã xóa'),
(10, 2, 'Đá Sapphire xanh lục Phan Thiết 6,99ct – IRGS171 2403699', 125820000, 'còn hàng', 10000000, 1, 'Đá Sapphire màu xanh lục tự nhiên, giác cắt quốc tế cushion - facet, lửa chiếu long lanh, đủ đáy, độ lành sạch 99%, độ tinh khiết cao. Trọng lượng 6,99ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:xanh lục,weight:6,99ct,size:11 x 10,3 - 7,6mm,opacity:Đủ đáy,Chiếu long lanh toàn viên,cutting_form:Cushion - facet/', '2024-04-26 15:57:06', '2024-04-26 15:57:06', NULL, NULL, 'đã xóa'),
(11, 2, 'Viên Sapphire vàng tự nhiên 100% chưa qua nhiệt 2,62ct – IRYS152 2312262', 47160000, 'còn hàng', 5000000, 1, 'Sapphire vàng giúp chủ sở hữu loại bỏ được những suy nghĩ tiêu cực để mang lại sự thông thái về trí tuệ và tri thức.', '/color:vàng,weight:2,62ct,size:7,2mm - 5,5mm,opacity:Chiếu đẹp toàn viền, đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối round - facet/', '2024-04-26 15:57:06', '2024-04-26 15:57:06', NULL, NULL, 'đã xóa'),
(12, 5, 'Đá Tourmaline đỏ tự nhiên 100% 3,52ct – IRTM40 2401352', 24640000, 'còn hàng', 1000000, 1, 'Đá Tourmaline có màu đỏ tự nhiên 100%, trọng lượng: 3,52ct, cắt giác facet, hình khối oval tiêu chuẩn. Phù hợp lên nhẫn và dây chuyền thiết kế.', '/color:Đỏ,weight:3,52ct,size:10,6 x 8,5 - 5,9mm,opacity:Chiếu bung toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối oval - facet/', '2024-04-26 16:00:19', '2024-04-26 16:00:19', NULL, NULL, 'đã xóa'),
(13, 5, 'Đá Tourmaline xanh lục siêu rực 3,34ct – IRTM31 2401334', 16700000, 'còn hàng', 2000000, 1, 'Đá Tourmaline có khả năng tạo ra những ion âm, có tác dụng trung hòa ion dương, làm sạch bầu không khí, giúp bầu không khí trở nên trong lành và an toàn hơn.', '/color:xanh lục,weight:3,34ct,size:8,9 x 8,2 - 5,1mm,opacity:Chiếu đẹp toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối cushion - facet/', '2024-04-26 16:00:19', '2024-04-26 16:01:19', NULL, NULL, 'chưa xóa'),
(14, 2, 'Viên Sapphire sao trắng tự nhiên 100% 4,23ct – IRSP151 2312423', 29610000, 'còn hàng', 1000000, 1, 'Đá Sapphire sao trắng sáng rõ ràng, mặt trơn bóng, láng mịn. Biểu trưng cho sự sang trọng, lịch lãm và có khả năng mang lại sự giàu sang, phú quý. Phù hợp với thiết kế nhẫn hoặc mặt dây chuyền.\r\n\r\n', '/color:trắng,weight:4,23ct,size:9,6 x 8,6 - 4,9mm,opacity:Sao nét thẳng cánh cân trục cân đỉnh, chùm chân không ngắt không đứt.,cutting_form:Hình khối Oval - cabochon/', '2024-04-27 12:50:24', '2024-04-27 12:51:24', NULL, NULL, 'chưa xóa'),
(15, 2, 'Viên Sapphire sao nét 10 điểm màu lavender – IRSS 2211745', 37250000, 'còn hàng', 0, 1, 'Sapphire sao nét căng 10 điểm tuyển chọn kỹ lưỡng, cánh sao nét căng cân trục cân đỉnh. Màu Lavender đẹp lạ cá tính mang phong cách riêng.\r\n\r\n', '/color:Tím,weight:7.45ct,size:12 * 9.2 * 6.5mm,opacity:Bán trong - trong (chất bền vững liên kết tốt),cutting_form:Mài trơn cabachon/', '2024-04-27 12:53:07', '2024-04-27 12:53:07', NULL, NULL, 'chưa xóa'),
(16, 2, 'Viên Sapphire đen tuyền 4,45ct – IRSP138 2311445\n', 8900000, 'cÃ²n hÃ ng', 0, 1, 'Đá Sapphire đen tượng trưng cho sự bí ẩn, cuốn hút, đồng thời là biểu tượng của thịnh vượng. Nhẫn và vòng tay, dây chuyền trang sức từ đá Sapphire đặc biệt phù hợp với những người mệnh Thủy, Mộc', '/color:đen,weight:4,45ct,size:9,6 x 8,4 - 6mm,opacity:Chiếu bung toàn viên, đủ đáy,cutting_form:Hình khối cushion - facet/', '2024-04-27 12:54:45', '2024-04-27 12:54:45', NULL, NULL, 'đã xóa'),
(17, 2, 'Viên Sapphire đen tuyền 4,27ct – IRSP137 2311427', 8540000, 'còn hàng', 0, 1, 'Đá Sapphire đen tuyền 100% tự nhiên, thể hiện sự tự tin, quyết đoán và khả năng kiểm soát trong cuộc sống. Một trong những ý nghĩa quan trọng khác của đá sapphire đen là sự bình an và bảo vệ. \r\n\r\n', '/color:đen,weight:4,27ct,size:10,2 x 7,8 - 6,1mm,opacity:Chiếu toàn viên, đủ đáy,cutting_form:Hình khối oval - facet/', '2024-04-27 12:56:07', '2024-04-27 12:56:07', NULL, NULL, 'đã xóa'),
(18, 2, 'Viên Sapphire đen tuyền khối oval tiêu chuẩn 4,78ct – IRSP 237478', 9000000, 'còn hàng', 0, 1, 'ĐáSapphire đen khối Oval cắt giác facet tiêu chuẩn quốc tế hiện đại, rất phù hợp lên nhẫn nam với trọng lượng 4,78ct. viên đá mang nguồn sức mạnh nội lực, sự uy nghiêm có chút cuốn hút rất khó tả.\r\n\r\n', '/color:đen,weight:4,78ct,size:10,6 - 9 - 5,9mm,opacity:trong,cutting_form:Cắt giác Facet đẹp tiêu chuẩn/', '2024-04-27 12:57:21', '2024-04-27 12:57:21', NULL, NULL, 'chưa xóa'),
(19, 2, 'Đôi pink Sapphire facet hồng Lục Yên 1,05ct – IRSP141 2311105\n', 18900000, 'còn hàng', 0, 1, 'Đôi đá Sapphire Lục Yên màu hồng siêu hot được tuyển chọn và hoàn thiện tỉ mỉ, tinh tế. Hai viên Sapphire có kích thước bằng nhau thích hợp lên thiết kế nhẫn cưới hoặc khuyên tai cho mọi lứa tuổi.\r\n\r\n', '/color:hồng,weight:1,05ct,size:5,1mm - 5,1mm,opacity:Chiếu đẹp toàn viền, đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối oval - facet/', '2024-04-27 12:59:06', '2024-04-27 12:59:06', NULL, NULL, 'chưa xóa'),
(20, 2, 'Viên Sapphire màu tím 0,87ct – IRSP 236087', 6090000, 'còn hàng', 0, 1, 'Viên Sapphire tím đẹp nguyên bản tự nhiên 100%, cắt facet hiện đại sang trọng. Lên thiết kế đẹp cuốn hút, sự lựa chọn hoàn cho những ai có con mắt tinh tế. \r\n\r\n', '/color:tím hồng,weight:0,87ct,size:6,8 - 5 - 3,6mm,opacity:độ lành sạch cao,cutting_form:chưa xác định/\r\n', '2024-04-27 13:00:30', '2024-04-27 13:00:30', NULL, NULL, 'đã xóa'),
(21, 2, 'Viên Sapphire màu hot pink 3,30ct tự nhiên 100% – IRPS142 238330\n', 186000000, 'hết hàng', 0, 1, 'Sở hữu vẻ đẹp lung linh, sang trọng và quyền quý, Sapphire từ lâu đã chiếm trọn tìm cảm trong trái tim những người yêu đá quý. Nhưng Sapphire không chỉ gây ấn tượng với vẻ đẹp độc đáo bên ngoài mà còn được yêu thích và nổi tiếng với công dụng và ý nghĩa vô cùng tuyệt vời. ', '/color:hồng,weight:3,30ct,size:9,4 x 7,9 - 4,9mm,opacity:Độ lành sạch cao,cutting_form:Hình khối oval - facet/', '2024-04-27 13:17:59', '2024-04-27 13:17:59', NULL, NULL, 'chưa xóa'),
(22, 2, 'Viên Sapphire hồng chiếu bung tuyệt đẹp 2,56ct – IRSP 2208256\n', 56760000, 'còn hàng', 0, 1, 'Viên Sapphire hồng 2.56ct chiếu bung toàn viên màu tuyệt đẹp, phù hợp mệnh Hỏa và Thổ, dễ lên mặt dây chuyền hoặc mặt nhẫn.\r\n\r\n', '/color:hồng,weight:2,56ct,size:7.4 * 7.3 * 5.5mm,opacity:Trong suốt, sạch mắt thường,cutting_form:Cushion cân đối đủ đáy/', '2024-04-27 13:20:10', '2024-04-27 13:20:10', NULL, NULL, 'chưa xóa'),
(23, 2, 'Viên Sapphire tím hồng sáng lấp lánh 2,27ct – IRSP 2208227', 49940000, 'còn hàng', 200000, 0, 'Viên Sapphire tím hồng 2,27ct chiếu toàn viên màu lạ tuyệt đẹp. Xuất xứ: Lục Yên màu sắc: Tím hồng, phù hợp làm mặt dây chuyền, mặt nhẫn.\r\n\r\n', '/color:tím hồng,weight:2,27ct,size:7.7 * 6.6 * 4.6mm,opacity:Trong suốt, sạch tinh mắt thường,cutting_form:Cushion cân đối đủ đáy/', '2024-04-27 13:21:29', '2024-04-27 13:21:29', NULL, NULL, 'chưa xóa'),
(24, 2, 'Đôi Sapphire hồng Lục Yên 0,87ct – IRSP142 2311087\n', 16530000, 'còn hàng', 500000, 1, 'Đôi đá Sapphire Lục Yên màu hồng được tuyển chọn và hoàn thiện tỉ mỉ, tinh tế. Đá Sapphire hồng mang lại may mắn và tài lộc cho người sở hữu. Năng lượng từ đá Sapphire sẽ giúp chủ nhân tránh được những điềm xui rủi trong cuộc sống.\r\n\r\n', '/color:hồng,weight:0,87ct,size:4,2mm - 3,9mm,opacity:Chiếu toàn viên từ đáy, từ mọi giác cắt sáng rực.,cutting_form:Hình khối round - facet/', '2024-04-27 13:23:04', '2024-04-27 13:23:04', NULL, NULL, 'chưa xóa'),
(25, 2, 'Đá Sapphire facet hồng phớt tím 1,28ct – IRSP149 2312128', 19200000, 'còn hàng', 5000000, 1, 'Sapphire màu tím tượng trưng cho sự chung thủy trong tình yêu và hôn nhân viên mãn. Những trang sức được làm từ đá Sapphire tím rất được các cặp đôi yêu thích, được lựa chọn để làm quà tặng cho nhau trong những dịp quan trọng.\r\n\r\n', '/color:đỏ hồng,weight:1,28ct,size:5,7 x 5,4 - 4,2mm,opacity:Chiếu đẹp toàn viền, đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối oval - facet/', '2024-04-27 13:30:24', '2024-04-27 13:30:24', NULL, NULL, 'chưa xóa'),
(26, 1, 'Đá Ruby giọt nước tự nhiên 100% 1,12ct – IRRF215 2404112', 17920000, 'còn hàng', 1000000, 1, 'Đá Ruby đỏ hồng nguyên bản, giác cắt quốc tế pear - facet. Độ  long lanh, đủ đáy. Trọng lượng 1,12ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:đỏ,weight:1,12ct,size:6,4 x 5 - 3,9mm,opacity:Đủ đáy,Chiếu long lanh toàn viên,cutting_form:Pear - facet/', '2024-04-27 21:09:56', '2024-04-27 21:09:56', NULL, NULL, 'đã xóa'),
(27, 1, 'Đá Ruby huyết bồ câu nguyên bản Lục Yên 1,50ct – IRRF216 2404150', 52500000, 'Hết hàng', 5000000, 0, 'Đá Ruby huyết bồ câu nguyên bản, xuất xứ: Lục Yên, giác cắt quốc tế cushion - facet. Độ chiếu tốt, đủ đáy. Trọng lượng 1,50ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:đỏ,weight:1,50ct,size:6,9 x 5,8 - 3,8mm,opacity:Đủ đáy,Độ chiếu tốt,cutting_form:Cushion - facet/', '2024-04-27 21:09:56', '2024-04-27 21:09:56', NULL, NULL, 'đã xóa'),
(28, 1, 'Đá Ruby cabochon Lục Yên 1,76ct – IRRC214 2404176\n', 10560000, 'còn hàng', 1000000, 0, 'Đá Ruby màu đỏ đẹp. Xuất xứ: Lục Yên. Chất kính trong, liên kết bền vững, trọng lượng 1,76ct, hình khối cabochon. Phù hợp lên mẫu nhẫn, mặt dây thiết kế.\r\n\r\n', '/color:đỏ hồng,weight:1,76ct,size:8,2 x 6,5 - 3mm,opacity:Chất kính trong,cutting_form:Cabochon bề mặt sáng bóng/', '2024-04-27 21:12:37', '2024-04-27 21:12:37', NULL, NULL, 'đã xóa'),
(29, 1, 'Đá Ruby facet đỏ hồng Lục Yên tự nhiên 1,52ct – IRRF211 2403152\n', 45000000, 'còn hàng', 1000000, 0, 'Đá Ruby Lục Yên, giác cắt quốc tế cushion - facet. Độ long lanh toàn viên, đủ đáy. Trọng lượng 1,52ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:đỏ hồng,weight:1,52ct,size:7 x 5,5 - 4,7mm,opacity:Chiếu long lanh toàn viên,Đủ đáy,cutting_form:Cushion - facet/', '2024-04-27 21:12:37', '2024-04-27 21:12:37', NULL, NULL, 'đã xóa'),
(30, 1, 'Đá Ruby cabochon Lục Yên 9,65ct – IRRC208 2403965\n', 76000000, 'còn hàng', 5500000, 0, 'Đá Ruby màu đỏ đẹp, khối cao, mặt mịn, chất bán trong, liên kết bền vững, trọng lượng 9,65ct, hình khối cabochon.\r\n\r\n', '/color:đỏ,weight:9,65ct,size:13 x 11 - 6,2mm,opacity:chất bán trong,cutting_form:Oval - cabochon/', '2024-04-27 21:14:46', '2024-04-27 21:14:46', NULL, NULL, 'đã xóa'),
(31, 1, 'Đá Ruby facet Lục Yên 3,00ct – IRRF207 2402300', 163000000, 'háº¿t hÃ ng', 5000000, 0, 'Đá Ruby Lục Yên, đủ đáy, giác cắt quốc tế cushion - facet. Độ chiếu tốt, đủ đáy. Trọng lượng 3,00ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:đỏ,weight:3,00ct,size:8,3 x 8,2 - 5mm,opacity:Độ chiếu tốt,Đủ đáy,cutting_form:Hình khối cushion - facet/', '2024-04-27 21:14:46', '2024-04-27 21:14:46', NULL, NULL, 'đã xóa'),
(32, 1, 'Đá Ruby cabochon tự nhiên 100% 1,85ct – IRRC206 2401185\n', 12950000, 'còn hàng', 5000000, 0, 'Đá Ruby màu đỏ, khối cao, mặt mịn, chất lành không rạn, chất liên kết bền vững, trọng lượng 1,85ct, hình khối cabochon.\r\n\r\n', '/color:đỏ,weight:1,85ct,size:6,5 x 6 - 4,4mm,opacity:Chất lành không rạn,Khối cao - mặt mịn,cutting_form:Cabochon bề mặt sáng bóng/', '2024-04-27 21:17:39', '2024-04-27 21:17:39', NULL, NULL, 'chưa xóa'),
(33, 1, 'Viên Ruby facet đỏ hồng ánh cháo đồng 1,22ct – IRRF203 2401122\n', 24400000, 'còn hàng', 100000, 0, 'Đá Ruby hồng là một trong những loại đá quý hoàn hảo và đẹp nhất, chúng thể hiện quyền lực, sự tự do, may mắn và vui vẻ.\r\n\r\n', '/color:đỏ,weight:1,22ct,size:6,5 x 5,5 - 4,1mm,opacity:Chiếu bung toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Cushion - facet/', '2024-04-27 21:17:39', '2024-04-27 21:17:39', NULL, NULL, 'chưa xóa'),
(34, 1, 'Viên Ruby cabochon huyết kính 1,13ct – IRRC196 2312113\n', 5300000, 'còn hàng', 500000, 0, 'Với những người có mệnh Hỏa, Ruby đỏ là đá có màu tương hợp. Vì vậy viên đá này sẽ luôn mang đến cho những chủ nhân mệnh Hỏa những điều tốt lành nhất về sức khỏe và sự nghiệp.\r\n\r\n', '/color:đỏ,weight:1,13ct,size:5,9 x 5,4 - 3,2mm,opacity:Chất ngọc lành sạch,cutting_form:Hình khối Oval - cabochon/', '2024-04-27 21:24:42', '2024-04-27 21:24:42', NULL, NULL, 'chưa xóa'),
(35, 1, 'Viên Ruby cabochon Lục Yên 0,97ct – IRRC195 2312097\n', 10000000, 'còn hàng', 500000, 0, 'Đá Ruby rất tốt cho người mệnh thổ bởi vì Hỏa sinh Thổ, mọi vật bị đốt cháy sẽ hóa thành tro, bụi, đất, cát, khi đó hỏa của lửa sẽ sinh ra thổ của đất.\r\n\r\n', '/color:đỏ,weight:0,97ct,size:chưa xấc định,opacity:Chất ngọc kính trong,cutting_form:Hình khối Oval - cabochon/', '2024-04-27 21:24:42', '2024-04-27 21:24:42', NULL, NULL, 'chưa xóa'),
(36, 1, 'Viên Ruby sao tự nhiên 100% 0,98ct – IRSR184 2312098\n', 17640000, 'còn hàng', 500000, 0, 'Ruby sao dáng oval hiện đại, màu bóng đỏ ánh tím đẹp lạ mang cá tính riêng. Màu của sự may mắn, tương sinh với mệnh Thổ và Hỏa. Phù hợp lên thiết kế mặt dây chuyền hoặc mặt nhẫn.\r\n\r\n', '/color:đỏ,weight:0,98ct,size:6,6 x 5 - 3,1mm,opacity:Chất kính trong bền vững,cutting_form:Hình khối Oval - cabochon/', '2024-04-27 21:26:51', '2024-04-27 21:26:51', NULL, NULL, 'đã xóa'),
(37, 1, 'Viên Ruby facet đỏ hồng Lục Yên 2,20ct – IRRF182 2312220\n', 120000000, 'còn hàng', 5000000, 0, 'Đá Ruby màu đỏ hồng rực lửa tự nhiên, cắt giác facet sáng bóng, dáng Cushion. Phù hợp lên thiết kế mặt nhẫn hoặc mặt dây chuyền.\r\n\r\n', '/color:đỏ,weight:2,20ct,size:8,7 x 6,4 - 4,3mm,opacity:Hình khối cushion - facet,cutting_form:Chiếu bung toàn viên từ đáy, từ mọi giác cắt sáng rực./', '2024-04-27 21:26:51', '2024-04-27 21:26:51', NULL, NULL, 'chưa xóa'),
(38, 1, 'Viên Ruby facet đỏ hồng có sắc cháo đồng đẹp 1,75ct – IRRF177 2312175\n', 56000000, 'còn hàng', 5000000, 1, 'Đá Ruby là loại đá quý được lựa chọn để lên mẫu trang sức để có thể thuận tiện mang bên mình. Ngoài ra, đá Ruby có ý nghĩa sâu sắc trong phong thủy. Đây là viên đá tượng trưng cho Hỏa – nguyên tố mạnh mẽ nhất trong ngũ hành.\r\n\r\n', '/color:đỏ,weight:1,75ct,size:9,1 x 5,3 - 3,7mm,opacity:Chiếu đẹp toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối giọt nước/', '2024-04-27 21:29:11', '2024-04-27 21:29:11', NULL, NULL, 'chưa xóa'),
(39, 1, 'Viên Ruby cabochon đỏ huyết 7,28ct – IRRC173 2312728', 43680000, 'còn hàng', 5000000, 1, 'Đá Ruby là loại đá quý rất hiếm có, nhất là những viên đá quý Ruby có chất lượng tuyệt hảo.\r\n\r\n', '/color:đỏ,weight:7,28ct,size:11,1 x 9,2 - 7,3mm,opacity:Chất kính trong bền vững,cutting_form:Hình khối Oval - cabochon/', '2024-04-27 21:29:11', '2024-04-27 21:29:11', NULL, NULL, 'đã xóa'),
(40, 1, 'Viên Ruby sao Nghệ An 3,43ct tự nhiên – IRSR140 238343\n', 12000000, 'còn hàng', 1000000, 1, 'Đá Ruby sao là những viên đá phát sáng ra ngôi sao 6 cánh đối xứng với nhau, Ngôi sao tạo điểm nhấn và thu hút ánh nhìn của bất cứ ai từng được ngắm nhìn. Bởi vẻ đẹp riêng biệt Ruby sao luôn được săn lùng và tìm kiếm.\r\n\r\n', '/color:đỏ,weight:3,43ct,size:8,5 x 7,5 - 5,3m,opacity:Chất ngọc kính trong,cutting_form:Mài trơn cabochon láng mịn/', '2024-04-27 21:31:33', '2024-04-27 21:31:33', NULL, NULL, 'chưa xóa'),
(41, 1, 'Viên Ruby facet 1,65ct Lục Yên – IRRF138 238165\r\n', 18000000, 'còn hàng', 5000000, 1, 'Đá Ruby được xem là biểu tượng của tình yêu, biểu trưng cho sự nồng nàn và lãng mạn. Chính vì vậy, Nhẫn đá Ruby thường được chọn làm món quà truyền thống dành cho các cặp vợ chồng nhân kỷ niệm 40 năm ngày cưới của mình.\r\n\r\n', '/color:đỏ hồng,weight:1,65ct,size:7,5 x 6,7 - 4,8mm,opacity:có chút bao thể tự nhiên,cutting_form:khối oval - facet/\r\n', '2024-04-27 21:31:33', '2024-04-27 21:31:33', NULL, NULL, 'chưa xóa'),
(42, 1, 'Đôi Ruby facet đỏ hồng Lục Yên 1,50ct – IRRF163 2311150\n', 28500000, 'còn hàng', 100000, 1, 'Đôi đá Ruby Lục Yên nhỏ xinh màu đỏ hồng, được hoàn thiện tỉ mỉ tinh tế, đẹp về chất lượng sẽ tạo được ấn tượng mạnh với mọi người, đặt biệt khi được chế tác thành đôi bông tai.\r\n\r\n', '/color:Đỏ,Hồng,weight:1,50ct,size:5,3mm - 5,4mm,opacity:Chiếu đẹp toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối cushion - facet/', '2024-04-27 21:56:27', '2024-04-27 21:56:27', NULL, NULL, 'chưa xóa'),
(43, 1, 'Viên Ruby cabochon Lục Yên 13,5ct – IRRC161 2311135\n', 236250000, 'còn hàng', 100000, 1, 'Đá Ruby luôn được xem như loại đá quý hiếm nhất trên thế giới. Hội tụ đầy đủ tiêu chuẩn một viên đá quý cần có như là: màu sắc rực rỡ, độ cứng tốt nhất, phát sáng cực mạnh. Thêm vào đó đây là loại đá quý rất hiếm có, nhất là những viên đá quý Ruby có chất lượng tuyệt hảo.\r\n\r\n', '/color:đỏ,weight:13,5ct,size:13,6 x 11,4 - 8mm,opacity:Trong suốt 100%,cutting_form:Khối oval - cabochon/\r\n', '2024-04-27 21:56:27', '2024-04-27 21:56:27', NULL, NULL, 'chưa xóa'),
(44, 1, 'Viên Ruby facet hồng Lục Yên 0,58ct – IRRF153 2310058\r\n', 7500000, 'còn hàng', 500000, 1, 'Màu sắc của nhẫn đá Ruby là màu đỏ, hồng nên sẽ phù hợp với những người thuộc mệnh thổ, hoả, thuỷ. Mang đến cho người sở hữu những điều may mắn, tốt lành trong tình duyên, công việc, sự nghiệp.\r\n\r\n', '/color:đỏ,weight:0,58ct,size:4,9 x 4,8 - 2,6mm,opacity:Chiếu đẹp toàn viền, đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Khối cushion - facet/', '2024-04-27 21:58:28', '2024-04-27 21:58:28', NULL, NULL, 'chưa xóa'),
(45, 1, 'Viên Ruby facet đỏ hồng Lục Yên 0,76ct – IRRF154 2310076\r\n', 11000000, 'còn hàng', 200000, 1, 'Đá Ruby mang ý nghĩa đại diện cho quyền lực, thịnh vượng. Những người sở hữu những viên đá Ruby sẽ gặp nhiều thành công trong sự nghiệp, có thể làm chủ cuộc sống của bản thân và đạt được những điều mình mong muốn.\r\n\r\n', '/color:đỏ,weight:0,76ct,size:6,3 x 4,8 - 3,1mm,opacity:Chiếu đẹp toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối oval - facet/', '2024-04-27 21:58:28', '2024-04-27 21:58:28', NULL, NULL, 'đã xóa'),
(46, 1, 'Viên Ruby facet tự nhiên 0,62ct – IRRF147 239062\r\n', 6000000, 'còn hàng', 500000, 1, 'Đá Ruby viên đá biểu tượng của tình sự gắn kết vĩnh cửu, trong phong thủy màu đỏ là màu đem lại may mắn và tài lộc. Ruby Facet tự nhiên giác cắt sáng long lanh giúp bạn lên nhẫn hay mặt dây đều đẹp. \r\n\r\n', '/color:đỏ,weight:0,62ct,size:4,5 x 3,9 - 3,7mm,opacity:trong suốt,cutting_form:facet đầy đủ/', '2024-04-27 22:00:34', '2024-04-27 22:00:34', NULL, NULL, 'chưa xóa'),
(47, 1, 'Viên Ruby facet 1,65ct Lục Yên – IRRF138 238165\r\n', 18000000, 'còn hàng', 500000, 1, 'Đá Ruby được xem là biểu tượng của tình yêu, biểu trưng cho sự nồng nàn và lãng mạn. Chính vì vậy, Nhẫn đá Ruby thường được chọn làm món quà truyền thống dành cho các cặp vợ chồng nhân kỷ niệm 40 năm ngày cưới của mình.\r\n\r\n', '/color:đỏ,weight:1,65ct,size:7,5 x 6,7 - 4,8mm,opacity:có chút bao thể tự nhiên,cutting_form:khối oval - facet/', '2024-04-27 22:00:34', '2024-04-27 22:00:34', NULL, NULL, 'chưa xóa'),
(48, 1, 'Viên Ruby facet màu đỏ huyết tự nhiên 1,63ct – IRRF04 238163\r\n', 240000000, 'còn hàng', 5000000, 1, 'Ruby là biểu tượng của sự quý phái, sang trọng và đẳng cấp. Được mệnh danh là Vua của các loại đá quý tự nhiên. Người xưa tin rằng Ruby vượt trội hơn các loại đá quý khác về đặc tính và giá trị của nó đôi khi còn vượt qua cả Kim Cương.\r\n\r\n', '/color:đỏ,weight:1,63ct,size:7,8 - 6 - 3,8mm,opacity:Sạch 95% có bao thể đặc trưng,cutting_form:Oval facet tiêu chuẩn/', '2024-04-27 22:05:07', '2024-04-27 22:05:07', NULL, NULL, 'chưa xóa'),
(49, 1, 'Viên Ruby cabochon màu đỏ hồng Lục Yên 5,67ct – IRRB 235567\n', 26000000, 'còn hàng', 500000, 1, 'Dựa trên quan niệm phong thủy, đá Ruby được xem là lá bùa hộ mệnh cho nhũng ai sở hữu chúng. Viên đá Ruby màu đỏ hồng, tượng trưng một trái tim vĩ đại. Sở hữu được viên Hồng Ngọc Ruby này nghĩa là bạn đã có được may mắn và hạnh phúc trong cuộc sống.\r\n\r\n', '/color:đỏ,weight:5,67ct,size:9,5 - 9,2 - 6,3mm,opacity:Chất kính trong bền vững,cutting_form:Mài trơn cabochon láng mịn/', '2024-04-27 22:05:07', '2024-04-27 22:05:07', NULL, NULL, 'chưa xóa'),
(50, 1, 'Viên Ruby sao Yên Bái sao nét 2,48ct – IRRB 237248\n', 36000000, 'còn hàng', 500000, 1, 'Đá Ruby sao không những được đánh giá cao về giá trị thẩm mỹ mà nó còn có những ý nghĩa tuyệt vời mà ít ai biết đến. Với màu đỏ hồng không chỉ tôn vinh vẻ đẹp của phụ nữ, đá Ruby còn là biểu tưởng của tình yêu nồng cháy đôi lứa.\r\n\r\n', '/color:đỏ hồng,weight:2.48ct,size:9 - 6,1 - 4mm,opacity:có bao thể tự nhiên của đá,cutting_form:Mài trơn cabochon láng mịn/', '2024-04-27 22:07:00', '2024-04-27 22:07:00', NULL, NULL, 'chưa xóa'),
(51, 1, 'Viên Ruby facet Lục Yên hàng tự nhiên 0,79ct – IRRB 237079\r\n', 18000000, 'còn hàng', 500000, 1, 'Ruby là loại đá quý đặc biệt, được hình thành trong quá trình biến đổi địa chất phức tạp, hấp thụ tinh hoa đất trời. Vì vậy, Ruby mang lại cho mình nguồn năng lượng và linh khí cao, do đó Ruby thường được làm vật may mắn trong phong thủy.\r\n\r\n', '/color:đỏ huyết,weight:0,79ct,size:5,5 - 4,7 - 3,5mm,opacity:độ lành sạch cao,cutting_form:Giác cắt Facet tiêu chuẩn đủ đáy/', '2024-04-27 22:07:00', '2024-04-27 22:07:00', NULL, NULL, 'chưa xóa'),
(52, 1, 'Viên Ruby sao đẹp xuất sắc 2,18ct – IRRB 236218\r\n', 120000000, 'còn hàng', 10000000, 1, 'Ruby sao viên đá mang vẻ đẹp độc đáo, xuất xứ Nghệ An. Sở hữu tất cả những yếu tố tạo nên một siêu phẩm, chất ngọc trong, không rạn vỡ lên mặt nhẫn xứng tầm chủ sở hữu.\r\n\r\n', '/color:đỏ,weight:2,18ct,size:7,8 - 5,8 - 4,8mm,opacity:Chiếu đẹp toàn bề mặt,cutting_form:Oval cabachon/', '2024-04-27 22:09:38', '2024-04-27 22:09:38', NULL, NULL, 'chưa xóa'),
(53, 1, 'Viên Ruby Cabochon màu đỏ huyết 4,50ct – IRRB 236450\r\n', 32000000, 'còn hàng', 500000, 1, 'Đá Ruby có thể khiến người đeo toát nên vẻ sang trọng. Ý nghĩa của đá Ruby trong gia đình đá quý tượng trưng cho sự ấm áp vì thế trang sức đá Ruby được rất nhiều khách hàng lựa chọn để làm quà tặng dành cho những người thân yêu trong những dịp quan trọng.\r\n\r\n', '/color:đỏ,weight:4,50ct,size:10,4 - 8,1 - 4,8mm,opacity:Chất kính trong bền vững,cutting_form:Mài trơn cabochon láng mịn/', '2024-04-27 22:09:38', '2024-04-27 22:09:38', NULL, NULL, 'chưa xóa'),
(54, 1, 'Viên Ruby cabochon màu đỏ huyết 2,91ct – IRRB 236291\r\n', 26000000, 'còn hàng', 1000000, 1, 'Đá Ruby là một trong những loại đá quý phổ biến nhất và được sử dụng để làm trang sức. Với màu sắc đỏ huyết bồ câu và ánh lấp lánh đặc biệt, Ruby thường được đặt trong các thiết kế nhẫn, dây chuyền và vòng tay.\r\n\r\n', '/color:đỏ huyết,weight:2,91ct,size:8,5 - 6,9 - 5,1mm,opacity:Mài trơn cabochon láng mịn,cutting_form:cacbochon/', '2024-04-27 22:12:54', '2024-04-27 22:12:54', NULL, NULL, 'chưa xóa'),
(55, 1, 'Viên Ruby facet Lục Yên tự nhiên 0,56ct – IRRB 235056\r\n', 8400000, 'còn hàng', 1000000, 0, 'Ruby facet có xuất xứ Lục Yên  tự nhiên đẹp không tỳ vết, trọng lượng 0,56ct xinh xắn khi lên mặt nhẫn hay mặt dây chuyền đặc biệt dành riêng cho mệnh Hỏa và Thổ.\r\n\r\n', '/color:đỏ,weight:0,56ct,size:5,5 - 3,8 - 2,8mm,opacity:Chiếu đẹp toàn viên, đủ đáy,cutting_form:Giác cắt Facet tiêu chuẩn đủ đáy/', '2024-04-27 22:12:54', '2024-04-27 22:12:54', NULL, NULL, 'chưa xóa'),
(56, 1, 'Viên Ruby facet đỏ hồng tự nhiên 0,37ct – IRRB 2350037\n', 5500000, 'còn hàng', 500000, 1, 'Ruby facet dáng Oval hiện đại, màu đỏ hồng đẹp lạ mang cá tính riêng. Màu của sự may mắn, tương sinh với mệnh Thổ và Hỏa.\r\n\r\n', '/color:đỏ hồng,weight:0.37ct,size:6,5 - 3,5 - 2mm,opacity:Chiếu đẹp toàn viên, đầy đủ đáy,cutting_form:facet/', '2024-04-27 22:15:22', '2024-04-27 22:15:22', NULL, NULL, 'chưa xóa'),
(57, 1, 'Viên Ruby đỏ hồng Lục Yên 0,36ct – IRRB 235036\r\n', 5400000, 'còn hàng', 100000, 1, 'Ruby facet Lục Yên cắt giác Facet màu đỏ hồng tươi sáng, dáng tròn xinh xắn phù hợp cho nữ lên mặt nhẫn. Khối đẹp tiêu chuẩn, đủ đáy lửa chiếu đẹp toàn viên.\r\n\r\n', '/color:đỏ hồng,weight:0.36ct,size:4,2 - 3,9 - 2,6mm,opacity:Chiếu toàn viên, đủ đáy,cutting_form:Cắt giác Facet đẹp tiêu chuẩn, góc cắt sắc nét./', '2024-04-27 22:15:22', '2024-04-27 22:15:22', NULL, NULL, 'chưa xóa'),
(58, 1, 'Viên Ruby Lục Yên màu đỏ huyết 0,90ct – IRRB 235090\n', 4500000, 'còn hàng', 0, 0, 'Viên Ruby cùng vẻ lung linh, sang trọng mà nó sở hữu. Đá Ruby cabachon cũng là một trong những loại đá trang sức rất được lòng các chị em phụ nữ bởi sự tinh tế và cuốn hút  nó mang lại.\r\n\r\n', '/color:đỏ hồng,weight:0,90ct,size:5,5 - 5,4 - 2,7mm,opacity:Chất kính trong bền vĩnh cửu,cutting_form:Mài trơn cabachon bóng mịn/', '2024-04-27 22:17:52', '2024-04-27 22:17:52', NULL, NULL, 'đã xóa'),
(59, 1, 'Viên Ruby cabachon màu đỏ huyết 0,92ct – IRRB 235092\n', 4600000, 'còn hàng', 0, 0, 'Viên Ruby là biểu tượng của tình yêu, sự gắn kết chính vì thế Ruby luôn được ưu tiên lựa chọn trong những dịp quan trọng để làm quà tặng. Những thiết kế phổ biến như vòng tay, nhẫn, dây chuyền…\r\n\r\n', '/color:đỏ huyết,weight:0.92ct,size:5,9 - 4,8 - 2,9mm,opacity:Mài trơn cabachon bóng mịn,cutting_form::chất bán trong/', '2024-04-27 22:17:52', '2024-04-27 22:17:52', NULL, NULL, 'chưa xóa'),
(60, 1, 'Viên Ruby facet đỏ hồng Lục Yên 1,30ct – IRRB 234130\n', 2600000, 'còn hàng', 0, 0, 'Ruby facet có xuất xứ Lục Yên  tự nhiên đẹp không tỳ vết, trọng lượng 1.ct xinh xắn khi lên mặt nhẫn hay mặt dây chuyền đặc biệt dành riêng cho mệnh Hỏa và Thổ.\r\n\r\n', '/color:đỏ hồng,weight:1.30ct,size:6,3 - 5,1 - 4,2mm,opacity:lành sạch liên kết bền vững,cutting_form:Chiếu toàn viên, đủ đáy/', '2024-04-27 22:21:28', '2024-04-27 22:21:28', NULL, NULL, 'đã xóa'),
(61, 1, 'Viên Ruby cabochon Lục Yên tự nhiên 100% 5,00ct – IRRB 237500', 22000000, 'hết hàng', 500000, 1, 'Viên Ruby cùng vẻ lung linh, sang trọng mà nó sở hữu. Ruby Cabachon là viên đá mà các nhà thiết kế trang sức luôn ưu ái lựa chọn bởi vẻ đẹp mà nó sở hữu cuốn hút, đam mê như một sức mạnh vô hình khiến bạn say mê nó. \r\n\r\n', '/color:đỏ,weight:5.00ct,size:10,9 - 8,9 - 4,2mm,opacity:Chất kính trong,cutting_form:Mài trơn cabochon láng mịn/', '2024-04-28 08:31:57', '2024-04-28 08:31:57', NULL, NULL, 'chưa xóa'),
(62, 1, 'Viên Ruby facet đỏ hồng tự nhiên 0,37ct – IRRB 2350037\n', 5500000, 'còn hàng', 500000, 0, 'Ruby facet dáng Oval hiện đại, màu đỏ hồng đẹp lạ mang cá tính riêng. Màu của sự may mắn, tương sinh với mệnh Thổ và Hỏa.\r\n\r\n', '/color:đỏ hồng,weight:0.37ct,size:6,5 - 3,5 - 2mm,opacity:Chiếu đẹp toàn viên, đầy đủ đáy,cutting_form:facet/', '2024-04-28 08:59:47', '2024-04-28 08:59:47', NULL, NULL, 'chưa xóa'),
(63, 1, 'Viên Ruby facet Lục Yên màu cháo đồng 0,70ct – IRRB 235070\n', 10500000, 'còn hàng', 0, 0, 'Ruby facet Lục Yên  tự nhiên nguyên bản đẹp không tỳ vết, trọng lượng 0,70ct xinh xắn khi lên mặt nhẫn hay mặt dây chuyền đặc biệt dành riêng cho mệnh Hỏa và Thổ.\r\n\r\n', '/color:đỏ hồng,weight:0,70ct,size:5,5 - 5 - 2,8mm,opacity:Sạch 95% có bao thể đặc trưng,cutting_form:Giác cắt Facet đẹp tiêu chuẩn/', '2024-04-28 09:13:42', '2024-04-28 09:13:42', NULL, NULL, 'đã xóa'),
(64, 1, 'Đôi Ruby facet Lục Yên tự nhiên 1,10ct – IRRB 234110\n', 15000000, 'còn hàng', 500000, 0, 'Đôi Ruby Lục Yên màu đỏ tím được tuyển chọn kỹ lưỡng từ vùng đất Ngọc Lục Yên, giác cắt tiêu chuẩn khối hiện đại, khối tiêu làm nhẫn cưới hoặc làm mặt nhẫn đôi là siêu phẩm.\r\n\r\n', '/color:đỏ tím,weight:1,10ct,size:5mm - 4,6mm,opacity:có bao thể tự nhiên của đá,cutting_form:Giác cắt Facet đẹp tiêu chuẩn/', '2024-04-28 09:13:42', '2024-04-28 09:13:42', NULL, NULL, 'chưa xóa'),
(65, 1, 'Viên Ruby đỏ huyết bồ câu facet 0,95ct – IRRF 2302095\n', 28500000, 'còn hàng', 0, 0, 'Viên Ruby đỏ huyết bồ câu, chất ngọc đẹp long lanh phát quang rực rỡ. Khối đẹp tiêu chuẩn, lên mặt dây nhẫn cho nữ chủ nhân mệnh Hỏa, mệnh Thổ xuất sắc.\r\n\r\n', '/color:đỏ huyết,weight:0.95ct,size:6.1 * 5 * 3.1mm,opacity:Sạch tinh bằng mắt thường,cutting_form:Giác cắt Facet đẹp tiêu chuẩn, góc đẹp long lanh/', '2024-04-28 09:49:54', '2024-04-28 09:49:54', NULL, NULL, 'chưa xóa'),
(66, 1, 'Viên Ruby Sao Yên Bái siêu nét 18,45ct – IRRS 22111845\n', 184500000, 'còn hàng', 0, 0, 'Ruby Sao Yên Bái nét tiêu chuẩn, tuyển chọn kỹ lưỡng về chất lượng và giá trị kinh tế. Có độ trong mọng mịn rất đẹp xứng đáng để anh chị sưu tầm và chơi lâu dài.\r\n\r\n', '/color:đỏ hồng,weight:18,45ct,size:19,1 * 11,8 * 6,9mm,opacity:Có độ trong mọng mịn rất đẹp.,cutting_form:Oval cabachon', '2024-04-28 09:49:54', '2024-04-28 09:49:54', NULL, NULL, 'chưa xóa'),
(67, 1, 'Đôi đá Ruby huyết kính 3,25ct – IRRB 2209325\r\n', 19500000, 'còn hàng', 0, 0, 'Hoa tai đá Ruby huyết kính hàng tuyển chọn, đẹp sang trọng cho quý cô yêu thích màu đỏ may mắn, tài lộc và sự bí ẩn.\r\n\r\n', '/color:đỏ huyết,weight:3,25ct cả đôi.size:viên bên trái7,1 * 5,4 * 3,7mm /  Viên bên phải: 7,6 * 5,6 * 3.9mm,opacity:Chất kính trong,cutting_form:Mài trơn cabachon/', '2024-04-28 09:52:14', '2024-04-28 09:52:14', NULL, NULL, 'chưa xóa'),
(68, 1, 'Viên Ruby đỏ huyết kính Lục Yên 7,45ct hàng tuyển – IRRB 2207745\n', 60000000, 'còn hàng', 0, 0, 'Viên đá Ruby huyết kính Lục Yên hàng tuyển chọn hiếm có, đỏ rực chất kính trong. Xuất xứ Lục Yên, tự nhiên 100% màu đỏ huyết chất kính, có rạn kín và bao thể tự nhiên bên trong đá.\r\n\r\n', '/color:đỏ huyết,weight:7.45 ct,size:12.7 - 10.3 - 6.5 mm,opacity:Bán trong – trong kính bền vững,cutting_form:Mài trơn cabachon/', '2024-04-28 09:52:14', '2024-04-28 09:52:14', NULL, NULL, 'chưa xóa'),
(69, 1, 'Viên Ruby facet Lục Yên 1,79ct – IRRF 2206179\r\n', 62650000, 'còn hàng', 0, 0, 'Viên Ruby facet Lục Yên là viên đá rất đẹp, khai thác tự nhiên thiên nhiên 100% trên mỏ đá của Lục Yên - Yên Bái\r\n\r\n', '/color:đỏ hồng,weight:1.79ct,size:8.7-6.4-4.4ct,opacity:Sạch tinh bằng mắt thường,cutting_form:facet/', '2024-04-28 09:59:53', '2024-04-28 09:59:53', NULL, NULL, 'đã xóa'),
(70, 1, 'Viên Ruby đỏ hồng Lục Yên 2,2ct chiếu đẹp – IRRF 2206220\r\n', 70000000, 'còn hàng', 0, 0, 'Viên Ruby đỏ hồng lửa chiếu toàn viên, chất đá đanh rực sáng trọng lượng: 2,2ct, kích thước: 8.7 - 6.4 - 4.4 mm xuất xứ đá núi Lục Yên.\r\n\r\n', '/color:đỏ hồng,weight:2.2 ct,size:8.7 - 6.4 - 4.4 mm,opacity:Trong suốt, có lỗi tự nhiên kín dưới đáy khó thấy, lửa chiếu bung toàn viên từng giác cắt.,cutting_form:facet/', '2024-04-28 09:59:53', '2024-04-28 09:59:53', NULL, NULL, 'chưa xóa'),
(71, 6, 'Đá Aquamarine xanh biển Thanh Hoá 2,87ct – IRAQ20 2404287\r\n', 172300000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển tự nhiên, xuất xứ: Thanh Hoá, giác cắt quốc tế pear - facet, chiếu toàn viên long lanh, độ lành sạch chất lành không rạn vỡ, tinh khiết cao. Trọng lượng 2,87ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:xanh biển,weight:2,87ct,size:13 x 7,8 - 5,3mm,opacity:Chiếu long lanh toàn viên,Đủ đáy,cutting_form:Pear - facet/', '2024-04-28 11:10:14', '2024-04-28 11:10:14', NULL, NULL, 'chưa xóa'),
(72, 6, 'Đá Aquamarine xanh biển tự nhiên 100% 2,94ct – IRAQ19 2404294\r\n', 14700000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển tự nhiên, giác cắt quốc tế cushion - facet, chiếu toàn viên long lanh, độ lành sạch, tinh khiết cao. Trọng lượng 2,94ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:xanh biển,weight:2,94ct,size:9,7 x 7,9 - 6,3mm,opacity:Đủ đáy,Chiếu long lanh toàn viên,cutting_form:Cushion - facet/', '2024-04-28 11:10:14', '2024-04-28 11:10:14', NULL, NULL, 'chưa xóa'),
(73, 6, 'Đá Aquamarine xanh biển tự nhiên 5,00ct – IRAQ18 2403500\r\n', 25000000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển tự nhiên, giác cắt quốc tế emerald - facet, chiếu rực rỡ toàn viên, độ lành sạch, tinh khiết cao. Trọng lượng 5,00ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:xanh biển,weight:5,00ct,size:12,1 x 9 - 6mm,opacity:Lửa chiếu rực rỡ toàn viên,cutting_form:Emerald - facet/', '2024-04-28 11:11:50', '2024-04-28 11:11:50', NULL, NULL, 'chưa xóa'),
(74, 6, 'Đá Aquamarine xanh biển tự nhiên 3,50ct – IRAQ17 2403350\r\n', 18000000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển tự nhiên, giác cắt quốc tế radiant - facet, chiếu toàn viên long lanh, độ lành sạch 99%, tinh khiết cao. Trọng lượng 3,50ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:xanh biển,weight:3,50ct,size:8,9 x 8,5 - 7mm.opacity:Chiếu long lanh toàn viên,cutting_form:Radiant - facet/', '2024-04-28 11:11:50', '2024-04-28 11:11:50', NULL, NULL, 'đã xóa'),
(75, 6, 'Đá Aquamarine xanh biển tự nhiên 5,29ct – IRAQ16 2403529\r\n', 26500000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển tự nhiên 100%, giác cắt quốc tế asscher - facet, chiếu toàn viên long lanh. Trọng lượng 5,29ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:xanh biển,weight:5,29ct,color:11,7 x 8,9 - 7,1mm,opacity:Độ lành sạch 99%,cutting_form:Asscher - facet/', '2024-04-28 11:13:51', '2024-04-28 11:13:51', NULL, NULL, 'đã xóa'),
(76, 6, 'Đá Aquamarine xanh biển tự nhiên 100% 6,58ct – IRAQ15 2402658\r\n', 32900000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển tự nhiên 100%, giác cắt quốc tế Cushion - facet, lửa chiếu toàn viên long lanh. Trọng lượng 6,58ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:xanh biển,weight:6,58ct,size:12,1 x 11,2 - 8,2mm,opacity:Chiếu long lanh toàn viên,cutting_form:Hình khối cushion - facet', '2024-04-28 11:13:51', '2024-04-28 11:13:51', NULL, NULL, 'chưa xóa'),
(77, 6, 'Đá Aquamarine xanh biển tự nhiên 100% 4,17ct – IRAQ14 2402417\r\n', 25000000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển tự nhiên 100%, đủ đáy, giác cắt quốc tế Cushion - facet, lửa chiếu toàn viên long lanh. Trọng lượng 4,17ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:xanh biển,weight:4,17ct,size:9,4 x 9,2 - 7,3mm,opacity:Chiếu long lanh toàn viên,cutting_form:Hình khối cushion - facet/', '2024-04-28 11:18:14', '2024-04-28 11:18:14', NULL, NULL, 'chưa xóa'),
(78, 6, 'Đá Aquamarine xanh biển tự nhiên 100% 7,73ct – IRAQ13 2402773\r\n', 31000000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển tự nhiên 100%, đủ đáy, giác cắt quốc tế Princess - facet, hình khối cushion, lửa chiếu toàn viên sáng rực. Trọng lượng 7,73ct. Phù hợp lên mặt dây chuyền và nhẫn.\r\n\r\n', '/color:xanh dương,weight:7,73ct,size:13,5 x 10,4 - 8,2mm,opacity:Lửa chiếu rực rỡ toàn viên,cutting_form:Hình khối Princess - facet,Cushion', '2024-04-28 11:18:14', '2024-04-28 11:18:14', NULL, NULL, 'chưa xóa'),
(79, 6, 'Đá Aquamarine xanh biển có gam màu đẹp nhất 4,30ct – IRAQ08 2401430\r\n', 19350000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển, đủ đáy, giác cắt quốc tế, độ chiếu toàn viên long lanh. Trọng lượng 4,30ct, hình khối cushion - facet. \r\n\r\n', '/color:xanh dương,weight:4,30ct,size:11,1 x 9,9 - 5,7mm,opacity:Chiếu đẹp mọi góc cạnh, đủ đáy,cutting_form:Hình khối cushion - facet/', '2024-04-28 11:20:12', '2024-04-28 11:20:12', NULL, NULL, 'chưa xóa'),
(80, 6, 'Đá Aquamarine xanh biển tự nhiên 100% 4,50ct – IRAQ07 2401450\r\n', 20300000, 'còn hàng', 0, 0, 'Đá Aquamarine màu xanh biển, đủ đáy, giác cắt quốc tế, trọng lượng 4,50ct, hình khối cushion - facet.\r\n\r\n', '/color:xanh lam,weight:4,50ct,size:11,3 x 8,9 - 6,4mm,opacity:Bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối cushion - facet/', '2024-04-28 11:20:12', '2024-04-28 11:20:12', NULL, NULL, 'chưa xóa'),
(81, 6, 'Viên Aquamarine xanh dương tự nhiên 4,51ct – IRAQ6 2312451\r\n', 36100000, 'còn hàng', 0, 0, 'Đá Aquamarine có màu sắc xanh dương trong tự nhiên. Giác cắt sáng đẹp, dáng giọt nước, phù hợp lên mặt dây chuyền hoặc mẫu nhẫn thiết kế rất đẹp.\r\n\r\n', '/color:xanh dương,weight:4,51ct,size:10,2 x 9 - 7,9mm,opacity: Chiếu bung toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối cushion - facet/', '2024-04-28 11:22:19', '2024-04-28 11:22:19', NULL, NULL, 'chưa xóa'),
(82, 6, 'Viên Aquamarine màu xanh dương 9,56ct – IRAQ5 2312956\r\n', 40000000, 'còn hàng', 0, 0, 'Đá Aquamarine có màu sắc xanh dương trong tự nhiên. Chúng thường nằm sâu trong lòng đất và tích tụ rất nhiều năng lượng của vũ trụ. Giác cắt sáng đẹp, dáng giọt nước, phù hợp lên mặt dây chuyền.\r\n\r\n', '/color:xanh lam,weight:9,56ct,size:16,6 x 12 - 8,6mm,opacity:Chiếu đẹp toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối giọt nước/', '2024-04-28 11:22:19', '2024-04-28 11:22:19', NULL, NULL, 'chưa xóa'),
(83, 6, 'Tinh thể Aquamarine màu xanh lam 6,63g – IRAQ 236663\r\n', 20000000, 'còn hàng', 0, 0, 'Tinh thể aquamarine là khoáng vật nằm trong nhóm Beryl có màu sắc xanh lam. Trong đó, loại màu xanh lam,được hình thành trong tự nhiên qua quá trình chuyển hóa của các vật chất tự nhiên. Chúng thường nằm sâu trong lòng đất và tích tụ rất nhiều năng lượng của vũ trụ.\r\n\r\n', '/color:xanh lam,weight:6,63g,size:4,4 - 1,1cm,opacity:sạch trong,cutting_form:chưa xác định/', '2024-04-28 11:24:34', '2024-04-28 11:24:34', NULL, NULL, 'chưa xóa'),
(84, 6, 'Viên Aquamarine xanh dương 3,04 ct – IRAQ 233304\r\n', 10000000, 'còn hàng', 0, 0, 'Đá Aquamarine xanh dương, màu xanh nhẹ nhàng tinh tế, hiện đại. Chất ngọc lành sạch tinh có thể nhìn bằng mắt thường. Đá Aquamarine phù hợp mệnh Mộc và mệnh Thủy.\r\n\r\n', '/color:xanh nước biển,weight:3.04ct,size:8.4 * 7.2 * 6.2mm,opacity:Phát quang mạnh và hút sáng,cutting_form:Cắt khối Emerald tiêu chuẩn./', '2024-04-28 11:24:34', '2024-04-28 11:24:34', NULL, NULL, 'chưa xóa'),
(85, 6, 'Viên Aquamarine xanh tự nhiên đẹp tinh tế – IRAQ 221163\r\n', 28350000, 'còn hàng', 0, 0, 'Đá Aquamarine xanh đẹp tự nhiên màu xanh của Aquamarine, viên đá của thần biển bảo hộ và đem đến may mắn cho chủ sở hữu. Đẹp dịu dàng tinh tế sang trọng là những danh từ dành riêng cho viên đá này!\r\n\r\n', '/color:xanh lam,weight:6,3ct,size:12 * 9 * 7,2mm,opacity:Sạch tinh bằng mắt thường,cutting_form:Baguette vuông chữ nhật/', '2024-04-28 11:31:24', '2024-04-28 11:31:24', NULL, NULL, 'đã xóa'),
(86, 6, 'Viên Aquamarine xanh nước biển 9,95ct – IRAQ 2206995\r\n', 10750000, 'còn hàng', 0, 0, 'Viên đá Aquamarine xanh nước biển có màu xanh Lam nhạt tuyệt đẹp, trọng lượng 9,95ct, kích thước 22 x 8.6 x 6.2 mm tỷ lệ cân đối làm trang sức nhẫn, mặt dây.\r\n\r\n', '/color:xanh nước biển,weight:9.95ct,size:22 x 8.6 x 6.2 mm,opacity:trong suốt,cutting_form:giác cắt/', '2024-04-28 11:31:24', '2024-04-28 11:31:24', NULL, NULL, 'chưa xóa'),
(87, 5, 'Đá Tourmaline xanh lục siêu rực 3,33ct – IRTM32 2401333\r\n', 16650000, 'còn hàng', 0, 0, 'Đá Tourmaline tác động tới luân xa số 4 - Anahata, giúp chữa lành cho tim, nâng cao hệ miễn dịch, khơi mở tình yêu thương của con người. Biểu tượng cho năng lượng sống, phát triển và thịnh vượng.\r\n\r\n', '/color:xanh lục,weight:3,33ct,size:8,9 x 8,1 - 5,2mm,opacity:Chiếu bung toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối cushion - facet/', '2024-04-28 11:33:52', '2024-04-28 11:33:52', NULL, NULL, 'chưa xóa'),
(88, 5, 'Đá Tourmaline xanh lục siêu rực 3,34ct – IRTM31 2401334\n', 17000000, 'còn hàng', 0, 0, 'Đá Tourmaline có khả năng tạo ra những ion âm, có tác dụng trung hòa ion dương, làm sạch bầu không khí, giúp bầu không khí trở nên trong lành và an toàn hơn.\r\n\r\n', '/color:xanh lục,weight:3,34ct,size:8,9 x 8,2 - 5,1mm,opacity:Chiếu đẹp toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Hình khối cushion - facet/', '2024-04-28 11:33:52', '2024-04-28 11:33:52', NULL, NULL, 'chưa xóa'),
(89, 5, 'Viên Tourmaline tự nhiên 100% 3,52ct – IRTM29 2310352\r\n', 31700000, 'còn hàng', 0, 0, 'Tourmaline xanh lục giúp bạn khai mở trái tim tràn đầy yêu thương, và đón nhận sự cân bằng của cơ thể, giúp loại bỏ đi các chất độc trong cơ thể, giúp giảm stress, đem lại giấc ngủ ngon và sâu, tạo cảm giác bình an hơn. Đặc biệt, Tourmaline có thể được dùng để chữa các bệnh về tim, hệ miễn dịch.\r\n\r\n', '/color:xanh lục,weight:3,52ct,size:10,8 x 9,1 - 5,3mm,opacity:Chiếu đẹp toàn viên, đầy đủ đáy, bề mặt sáng bóng giác cắt đẹp,cutting_form:Giác cắt Facet tiêu chuẩn đủ đáy/', '2024-04-28 11:36:13', '2024-04-28 11:36:13', NULL, NULL, 'chưa xóa'),
(90, 5, 'Viên Tourmaline màu xanh lục sáng 3,55ct – IRTM 235355\n', 22000000, 'còn hàng', 0, 0, 'Viên Tourmaline xanh lục sáng tươi, màu xanh đẹp cuốn hút đầy say mê không thể rời mắt. Xanh của sự sinh nổi nảy nở là biểu tượng của sự khởi đầu thành công!\r\n\r\n', '/color:xanh lục,weight:3,55ct,size8,5 - 8,3 - 7,2mm,opacity:Sạch tinh bằng mắt thường,cutting_form:Giác cắt Facet tiêu chuẩn đủ đáy/', '2024-04-28 11:36:13', '2024-04-28 11:36:13', NULL, NULL, 'đã xóa'),
(91, 8, 'Đá Garnet Lục Yên tự nhiên 100% 5,30ct – IRGN113 2401530\r\n', 21200000, 'còn hàng', 0, 0, 'Đá Garnet tự nhiên 100%, gam màu đẹp nhất, có trọng lượng: 5,30ct, hình khối cushion - facet, độ chiếu tốt, đủ đáy. Phù hợp lên mẫu nhẫn hoặc mặt dây thiết kế.\r\n\r\n', '/color:đỏ;weight:5,30ct;size:9,3 x 9,2 - 7mm;opacity:Chiếu đẹp toàn viên, đầy đủ đáy;cutting_form:Hình khối cushion - facet/', '2024-04-28 13:18:50', '2024-04-28 13:18:50', NULL, NULL, 'chưa xóa'),
(92, 8, 'Đá Garnet Lục Yên tự nhiên 100% 1,75ct – IRGN112 2401175\r\n', 7000000, 'hết hàng', 0, 0, 'Đá Garnet tự nhiên 100% xuất xứ từ mỏ mới của Lục Yên màu rất đẹp đỏ sáng khác hoàn toàn với đá Garnet trước đây, có trọng lượng: 1,75ct, hình khối oval - facet, đủ đáy, lành sạch cao, lửa chiếu rực rỡ. Phù hợp lên mẫu nhẫn hoặc mặt dây thiết kế.\r\n\r\n', '/color:đỏ;weight:1,75ct;size:7,3 x 6,6 - 4,4mm;opacity:Lửa chiếu rực rỡ toàn viên\r\n;cutting_form:Hình khối oval - facet/\r\n', '2024-04-28 13:18:50', '2024-04-28 13:18:50', NULL, NULL, 'chưa xóa'),
(93, 8, 'Đá Garnet Lục Yên tự nhiên 100% 2,37ct – IRGN111 2401273\r\n', 11000000, 'hết hàng', 0, 0, 'Đá Garnet tự nhiên 100% xuất xứ từ mỏ mới của Lục Yên màu rất đẹp đỏ sáng khác hoàn toàn với đá Garnet trước đây, có trọng lượng: 2,73ct, hình khối cushion - facet, đủ đáy, lành sạch cao, chiếu rực rỡ. Phù hợp lên mẫu nhẫn hoặc mặt dây thiết kế.\r\n\r\n', '/color:đỏ;weight:2,37ct;size:7,8 x 7,5 - 4,6mm;opacity:Chiếu đẹp toàn viên, mọi giác cắt sáng rực;cutting_form:Hình khối cushion - facet/', '2024-04-28 13:24:54', '2024-04-28 13:24:54', NULL, NULL, 'chưa xóa'),
(94, 8, 'Đá Garnet màu đỏ hồng tự nhiên 100% Lục Yên 2,19ct – IRGN108 2401219\r\n', 9000000, 'hết hàng', 0, 0, 'Đá Garnet tự nhiên 100% xuất xứ từ mỏ mới của Lục Yên màu rất đẹp đỏ sáng khác hoàn toàn với đá Garnet trước đây, có trọng lượng: 2,19ct, hình khối cushion - facet, đủ đáy, tinh khiết và lành sạch cao. Phù hợp lên mẫu nhẫn hoặc mặt dây thiết kế.\r\n\r\n', '/color:đỏ;weight:2,19ct;size:7,6 x 7 - 4,9mm;opacity:Chiếu đẹp mọi góc cạnh, đủ đáy;cutting_form:Hình khối cushion - facet/', '2024-04-28 13:24:54', '2024-04-28 13:24:54', NULL, NULL, 'chưa xóa'),
(95, 8, 'Viên Garnet màu xanh táo hiếm gặp 4,15ct – IRGN 235415\r\n', 56000000, 'hết hàng', 0, 0, 'Những màu sắc mà thiên nhiên mang lại, đá garnet màu xanh táo hiếm gặp được mọi người đặt trọn niềm yêu thích đặc biệt. Đá garnet màu xanh táo được biết đến mang may nắm và giàu có cho chủ sở hữu.\r\n\r\n', '/color:xanh lá;weight:4,15ct\r\n;size:8,7 - 8,7 - 6,7mm;opacity:độ lành sạch cao\r\n;cutting_form:Giác cắt Facet đẹp tiêu chuẩn/\r\n', '2024-04-28 13:33:43', '2024-04-28 13:33:43', NULL, NULL, 'chưa xóa'),
(96, 8, 'Viên Tsavorite xanh lục bảo hiếm có 3,2ct – IRTS 221132\r\n', 32000000, 'còn hàng', 0, 0, 'Đá Tsavorite (Garnet xanh) màu xanh lục bảo hiếm gặp. Xanh lục  thuộc Top đầu dòng đá Tsovarite, đẹp như Ngọc lục bảo màu đẹp nhất.\r\n\r\n', '/color:xanh lá;weight:3,2ct\r\n;size:8.2 * 7.4 * 6mm\r\n;opacity:Sạch 95% có bao thể đặc trưng\r\n;cutting_form:Giác cắt Facet đẹp tiêu chuẩn/', '2024-04-28 13:33:43', '2024-04-28 13:33:43', NULL, NULL, 'đã xóa'),
(97, 8, 'Viên Garnet trái tim màu hồng tím 3,00ct – IRGN82 233300\r\n', 6600000, 'còn hàng', 0, 0, 'Đá Garnet mang lại may mắn, cân bằng năng lượng, sức khỏe dồi dào. Viên đá này còn mang ý nghĩa như một lá bùa hộ mệnh. So với các loại đá phong thủy khác, đá Garnet có nhiều sắc và được nhiều  người chọn lựa.\r\n\r\n', '/color:đỏ;weight:3,00ct;size:8,2 - 8,8 -5,4mm;opacity:Chiếu đẹp toàn viên, đủ đáy;cutting_form:Hình khối Heart - Facet', '2024-04-28 14:15:24', '2024-04-28 14:15:24', NULL, NULL, 'chưa xóa'),
(98, 8, 'Viên Garnet màu tím tự nhiên 0,99ct – IRGN 234099\r\n', 2000000, 'hết hàng', 0, 0, 'Đá Garnet đỏ đậm tự nhiên 100%  khối cao, cắt facet đẹp,  màu đẹp mê đắm. Dành riêng cho mệnh Hỏa và Thổ lên siêu phẩm xuất sắc khi thiết kế mặt nhẫn hay mặt dây chuyền.\r\n\r\n', '/color:đỏ tím;weight:0,99ct\r\n;size:6 - 4,6 - 3,4mm\r\n;opacity:Chiếu đẹp toàn viên\r\n;cutting_form:Giác cắt Facet tiêu chuẩn\r\n/', '2024-04-28 14:15:24', '2024-04-28 14:15:24', NULL, NULL, 'chưa xóa'),
(99, 8, 'Viên Garnet màu đỏ tím 2,87ct – IRGN 233287\r\n', 5750000, 'hết hàng', 0, 0, 'Đá Garnet màu đỏ tím đẹp lạ cuốn hút, rất phù hợp lên nhẫn nữ, mặt dây, hoa tai. Vẻ đẹp cuốn hút lạ mắt của viên đá khẳng định gu thẩm mỹ của chủ sở hữu.\r\n\r\n', '/color:đỏ tím;weight:2,87ct\r\n;size:9,1 * 6,6 * 4,8mm\r\n;opacity:Sạch tinh bằng mắt thường;cutting_form:Giác cắt Facet đẹp tiêu chuẩn, góc đẹp long lanh\r\n/\r\n\r\n', '2024-04-28 14:21:43', '2024-04-28 14:21:43', NULL, NULL, 'chưa xóa'),
(100, 8, 'Viên Rhodolite Garnet đẹp hiện đại 2,34ct – IRGN 233234\r\n', 6800000, 'hết hàng', 0, 0, 'Viên Rhodolite Granet dáng hiện đại được tuyển chọn kỹ lưỡng từ những viên đá thô tại mỏ. Rhodolite Garnet tượng trưng cho tình yêu, sự thủy chung rất phù hợp để lên nhẫn cưới, đính hôn hay tặng bạn gái…\r\n\r\n', '/color:đỏ tím;weight:2,76ct;size:9.0 * 5.7 * 4.2mm\r\n;opacity:Sạch tinh bằng mắt thường\r\n;cutting_form:Emerald tinh khiết/\r\n', '2024-04-28 14:21:43', '2024-04-28 14:21:43', NULL, NULL, 'chưa xóa'),
(101, 0, 'spinel', 10000, 'on', 0, 0, 'đây là sản phẩm tốt', '/color:đỏ,weight:3.51ct,size:0.38ct*4.32ct*5.13ct,opacity:trong s,cutting_form:giọt nước/', '2024-07-11 18:52:40', '2024-07-11 18:52:40', NULL, NULL, NULL),
(102, 7, 'đá kim cương thập cẩm', 100000, 'on', 0, 0, 'frefefeqfdeqfe', '/color:đỏ,weight:3.21ct,size:0.38ct*0.72ct*0.38ct,opacity:trong suốt,cutting_form:giọt nước/', '2024-07-11 19:18:56', '2024-07-11 19:18:56', NULL, NULL, NULL),
(103, 0, 'đá kim cương thập cẩm', 10000, 'Còn hàng', 0, 0, 'sản phẩm tốt', '/color:đỏ,weight:3.41,size:4.61,opacity:không có,cutting_form:không có/', '2024-07-11 21:26:27', '2024-07-11 21:26:27', NULL, NULL, NULL),
(104, 0, 'đá kim cương thập cẩm', 100000, 'Còn hàng', 0, 0, 'test', '/color:vàng,weight:321,size:111,opacity:chưa xác định ,cutting_form:chưa xác định/', '2024-07-11 21:37:08', '2024-07-11 21:37:33', NULL, NULL, NULL),
(105, 3, 'đá kim cương thập cẩm', 100000, 'Còn hàng', 0, 0, 'test', '/color:vàng,weight:321,size:111,opacity:chưa xác định ,cutting_form:chưa xác định/', '2024-07-11 21:45:10', '2024-07-11 21:45:11', NULL, NULL, NULL),
(106, 3, 'spinel', 5000000, 'Còn hàng', 0, 0, 'werrwerwe', '/color:wdfwe,weight:ưerwer,size:ưerwerew,opacity:ưerwer,cutting_form:ưerwer/', '2024-07-11 21:51:55', '2024-07-11 21:51:55', NULL, NULL, NULL),
(107, 2, 'spinel', 5000000, 'Còn hàng', 0, 0, 'werrwerwe', '/color:wdfwe,weight:ưerwer,size:ưerwerew,opacity:ưerwer,cutting_form:ưerwer/', '2024-07-11 21:52:31', '2024-07-11 21:52:31', NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `product_image`
--

CREATE TABLE `product_image` (
  `id` int(11) NOT NULL,
  `img_main` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `img_1` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `img_2` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `img_3` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `img_4` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `product_image`
--

INSERT INTO `product_image` (`id`, `img_main`, `img_1`, `img_2`, `img_3`, `img_4`) VALUES
(1, 'https://iruby.vn/wp-content/uploads/2024/02/Da-Ruby-cabochon-tu-nhien-100-185ct-IRRC206-240118500000.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Da-Ruby-cabochon-tu-nhien-100-185ct-IRRC206-240118500001.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Da-Ruby-cabochon-tu-nhien-100-185ct-IRRC206-240118500001.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Da-Ruby-cabochon-tu-nhien-100-185ct-IRRC206-240118500003.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Da-Ruby-cabochon-tu-nhien-100-185ct-IRRC206-240118500004.jpg'),
(2, 'https://iruby.vn/wp-content/uploads/2024/02/Vien-Ruby-cabochon-chat-kinh-trong-141ct-IRRC205-240114100000.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Vien-Ruby-cabochon-chat-kinh-trong-141ct-IRRC205-240114100001.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Vien-Ruby-cabochon-chat-kinh-trong-141ct-IRRC205-240114100002.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Vien-Ruby-cabochon-chat-kinh-trong-141ct-IRRC205-240114100003.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Vien-Ruby-cabochon-chat-kinh-trong-141ct-IRRC205-240114100004.jpg'),
(3, 'https://iruby.vn/wp-content/uploads/2024/01/Da-Ruby-cabochon-mau-do-tu-nhien-100-726ct-IRRC204-240172600000.jpg', 'https://iruby.vn/wp-content/uploads/2024/01/Da-Ruby-cabochon-mau-do-tu-nhien-100-726ct-IRRC204-240172600001.jpg', 'https://iruby.vn/wp-content/uploads/2024/01/Da-Ruby-cabochon-mau-do-tu-nhien-100-726ct-IRRC204-240172600002.jpg', 'https://iruby.vn/wp-content/uploads/2024/01/Da-Ruby-cabochon-mau-do-tu-nhien-100-726ct-IRRC204-240172600003.jpg', 'https://iruby.vn/wp-content/uploads/2024/01/Da-Ruby-cabochon-mau-do-tu-nhien-100-726ct-IRRC204-240172600004.jpg'),
(4, 'https://iruby.vn/wp-content/uploads/2023/12/Vien-Ruby-cabochon-huyet-kinh-Luc-Yen-103ct-IRRC199-231210300000.jpg', 'https://iruby.vn/wp-content/uploads/2023/12/Vien-Ruby-cabochon-huyet-kinh-Luc-Yen-103ct-IRRC199-231210300001.jpg', 'https://iruby.vn/wp-content/uploads/2023/12/Vien-Ruby-cabochon-huyet-kinh-Luc-Yen-103ct-IRRC199-231210300002.jpg', 'https://iruby.vn/wp-content/uploads/2023/12/Vien-Ruby-cabochon-huyet-kinh-Luc-Yen-103ct-IRRC199-231210300003.jpg', 'https://iruby.vn/wp-content/uploads/2023/12/Vien-Ruby-cabochon-huyet-kinh-Luc-Yen-103ct-IRRC199-231210300004.jpg'),
(5, 'https://iruby.vn/wp-content/uploads/2024/02/Da-Aquamarine-xanh-bien-tu-nhien-100-658ct-IRAQ15-240265800000.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Da-Aquamarine-xanh-bien-tu-nhien-100-658ct-IRAQ15-240265800001.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Da-Aquamarine-xanh-bien-tu-nhien-100-658ct-IRAQ15-240265800002.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Da-Aquamarine-xanh-bien-tu-nhien-100-658ct-IRAQ15-240265800003.jpg', 'https://iruby.vn/wp-content/uploads/2024/02/Da-Aquamarine-xanh-bien-tu-nhien-100-658ct-IRAQ15-240265800004.jpg'),
(6, 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-trang-tinh-khiet-388ct-irtp57-2311388/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-trang-tinh-khiet-388ct-irtp57-2311388/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-trang-tinh-khiet-388ct-irtp57-2311388/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-trang-tinh-khiet-388ct-irtp57-2311388/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-trang-tinh-khiet-388ct-irtp57-2311388/#images-5'),
(7, 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-mau-trang-tinh-khiet-tu-nhien-100-226ct-irtp-237226/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-mau-trang-tinh-khiet-tu-nhien-100-226ct-irtp-237226/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-mau-trang-tinh-khiet-tu-nhien-100-226ct-irtp-237226/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-mau-trang-tinh-khiet-tu-nhien-100-226ct-irtp-237226/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-topaz/vien-topaz-mau-trang-tinh-khiet-tu-nhien-100-226ct-irtp-237226/#images-5'),
(8, 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-5'),
(9, 'https://iruby.vn/cua-hang/da-quy/da-sapphire-chao-dong-an-phu-luc-yen-122ct-irsp217-2404122/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-sapphire-chao-dong-an-phu-luc-yen-122ct-irsp217-2404122/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-sapphire-chao-dong-an-phu-luc-yen-122ct-irsp217-2404122/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-sapphire-chao-dong-an-phu-luc-yen-122ct-irsp217-2404122/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-sapphire-chao-dong-an-phu-luc-yen-122ct-irsp217-2404122/#images-5'),
(10, 'https://iruby.vn/cua-hang/da-quy/da-sapphire-xanh-luc-phan-thiet-699ct-irgs171-2403699/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-sapphire-xanh-luc-phan-thiet-699ct-irgs171-2403699/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-sapphire-xanh-luc-phan-thiet-699ct-irgs171-2403699/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-sapphire-xanh-luc-phan-thiet-699ct-irgs171-2403699/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-sapphire-xanh-luc-phan-thiet-699ct-irgs171-2403699/#images-5'),
(11, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-vang/vien-sapphire-vang-tu-nhien-100-chua-qua-nhiet-262ct-irys152-2312262/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-vang/vien-sapphire-vang-tu-nhien-100-chua-qua-nhiet-262ct-irys152-2312262/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-vang/vien-sapphire-vang-tu-nhien-100-chua-qua-nhiet-262ct-irys152-2312262/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-vang/vien-sapphire-vang-tu-nhien-100-chua-qua-nhiet-262ct-irys152-2312262/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-vang/vien-sapphire-vang-tu-nhien-100-chua-qua-nhiet-262ct-irys152-2312262/#images-5'),
(12, 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-do-tu-nhien-100-352ct-irtm40-2401352/#images-1', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-do-tu-nhien-100-352ct-irtm40-2401352/#images-2', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-do-tu-nhien-100-352ct-irtm40-2401352/#images-3', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-do-tu-nhien-100-352ct-irtm40-2401352/#images-4', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-do-tu-nhien-100-352ct-irtm40-2401352/#images-5'),
(13, 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-1', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-2', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-3', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-4', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-5'),
(14, 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-trang-tu-nhien-100-423ct-irsp151-2312423/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-trang-tu-nhien-100-423ct-irsp151-2312423/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-trang-tu-nhien-100-423ct-irsp151-2312423/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-trang-tu-nhien-100-423ct-irsp151-2312423/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-trang-tu-nhien-100-423ct-irsp151-2312423/#images-5'),
(15, 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-net-10-diem-mau-lavender-irss-2211745/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-net-10-diem-mau-lavender-irss-2211745/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-net-10-diem-mau-lavender-irss-2211745/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-net-10-diem-mau-lavender-irss-2211745/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/vien-sapphire-sao-net-10-diem-mau-lavender-irss-2211745/#images-5'),
(16, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-445ct-irsp138-2311445/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-445ct-irsp138-2311445/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-445ct-irsp138-2311445/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-445ct-irsp138-2311445/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-445ct-irsp138-2311445/#images-5'),
(17, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-427ct-irsp137-2311427/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-427ct-irsp137-2311427/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-427ct-irsp137-2311427/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-427ct-irsp137-2311427/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-427ct-irsp137-2311427/#images-5'),
(18, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-khoi-oval-tieu-chuan-478ct-irsp-237478/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-khoi-oval-tieu-chuan-478ct-irsp-237478/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-khoi-oval-tieu-chuan-478ct-irsp-237478/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-khoi-oval-tieu-chuan-478ct-irsp-237478/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-den/vien-sapphire-den-tuyen-khoi-oval-tieu-chuan-478ct-irsp-237478/#images-5'),
(19, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-pink-sapphire-facet-hong-luc-yen-105ct-irsp141-2311105/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-pink-sapphire-facet-hong-luc-yen-105ct-irsp141-2311105/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-pink-sapphire-facet-hong-luc-yen-105ct-irsp141-2311105/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-pink-sapphire-facet-hong-luc-yen-105ct-irsp141-2311105/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-pink-sapphire-facet-hong-luc-yen-105ct-irsp141-2311105/#images-5'),
(20, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-luc-yen/vien-sapphire-mau-tim-087ct-irsp-236087/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-luc-yen/vien-sapphire-mau-tim-087ct-irsp-236087/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-luc-yen/vien-sapphire-mau-tim-087ct-irsp-236087/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-luc-yen/vien-sapphire-mau-tim-087ct-irsp-236087/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-luc-yen/vien-sapphire-mau-tim-087ct-irsp-236087/#images-5'),
(21, 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/menh-tho/vien-sapphire-mau-hot-pink-330ct-tu-nhien-100-irps142-238330/#images-1', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/menh-tho/vien-sapphire-mau-hot-pink-330ct-tu-nhien-100-irps142-238330/#images-2', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/menh-tho/vien-sapphire-mau-hot-pink-330ct-tu-nhien-100-irps142-238330/#images-3', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/menh-tho/vien-sapphire-mau-hot-pink-330ct-tu-nhien-100-irps142-238330/#images-4', 'https://iruby.vn/wp-content/uploads/2023/08/vien-Sapphire-mau-HOT-Pink-330ct-tu-nhien-100-IRPS142-23833000002.jpg'),
(22, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-hong-chieu-bung-tuyet-dep-256ct-irsp-2208256/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-hong-chieu-bung-tuyet-dep-256ct-irsp-2208256/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-hong-chieu-bung-tuyet-dep-256ct-irsp-2208256/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-hong-chieu-bung-tuyet-dep-256ct-irsp-2208256/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-hong-chieu-bung-tuyet-dep-256ct-irsp-2208256/#images-5'),
(23, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-tim-hong-sang-lap-lanh-227ct-irsp-2208227/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-tim-hong-sang-lap-lanh-227ct-irsp-2208227/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-tim-hong-sang-lap-lanh-227ct-irsp-2208227/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-tim-hong-sang-lap-lanh-227ct-irsp-2208227/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-tim-hong-sang-lap-lanh-227ct-irsp-2208227/#images-5'),
(24, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-sapphire-hong-luc-yen-087ct-irsp142-2311087/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-sapphire-hong-luc-yen-087ct-irsp142-2311087/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-sapphire-hong-luc-yen-087ct-irsp142-2311087/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-sapphire-hong-luc-yen-087ct-irsp142-2311087/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/doi-sapphire-hong-luc-yen-087ct-irsp142-2311087/#images-5'),
(25, 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-facet-hong-phot-tim-128ct-irsp149-2312128/#images-1', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-facet-hong-phot-tim-128ct-irsp149-2312128/#images-2', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-facet-hong-phot-tim-128ct-irsp149-2312128/#images-3', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-facet-hong-phot-tim-128ct-irsp149-2312128/#images-4', 'https://iruby.vn/cua-hang/da-quy/sapphire/sapphire-hong/vien-sapphire-facet-hong-phot-tim-128ct-irsp149-2312128/#images-5'),
(26, 'https://iruby.vn/cua-hang/da-quy/da-ruby-giot-nuoc-tu-nhien-100-112ct-irrf215-2404112/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-ruby-giot-nuoc-tu-nhien-100-112ct-irrf215-2404112/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-ruby-giot-nuoc-tu-nhien-100-112ct-irrf215-2404112/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-ruby-giot-nuoc-tu-nhien-100-112ct-irrf215-2404112/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-ruby-giot-nuoc-tu-nhien-100-112ct-irrf215-2404112/#images-5'),
(27, 'https://iruby.vn/cua-hang/da-quy/da-ruby-huyet-bo-cau-nguyen-ban-luc-yen-150ct-irrf216-2404150/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-ruby-huyet-bo-cau-nguyen-ban-luc-yen-150ct-irrf216-2404150/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-ruby-huyet-bo-cau-nguyen-ban-luc-yen-150ct-irrf216-2404150/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-ruby-huyet-bo-cau-nguyen-ban-luc-yen-150ct-irrf216-2404150/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-ruby-huyet-bo-cau-nguyen-ban-luc-yen-150ct-irrf216-2404150/#images-5'),
(28, 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-176ct-irrc214-2404176/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-176ct-irrc214-2404176/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-176ct-irrc214-2404176/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-176ct-irrc214-2404176/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-176ct-irrc214-2404176/#images-5'),
(29, 'https://iruby.vn/cua-hang/da-quy/da-ruby-facet-do-hong-luc-yen-tu-nhien-152ct-irrf211-2403152/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-ruby-facet-do-hong-luc-yen-tu-nhien-152ct-irrf211-2403152/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-ruby-facet-do-hong-luc-yen-tu-nhien-152ct-irrf211-2403152/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-ruby-facet-do-hong-luc-yen-tu-nhien-152ct-irrf211-2403152/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-ruby-facet-do-hong-luc-yen-tu-nhien-152ct-irrf211-2403152/#images-5'),
(30, 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-965ct-irrc208-2403965/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-965ct-irrc208-2403965/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-965ct-irrc208-2403965/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-965ct-irrc208-2403965/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-ruby-cabochon-luc-yen-965ct-irrc208-2403965/#images-5'),
(31, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/da-ruby-facet-luc-yen-300ct-irrf207-2402300/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/da-ruby-facet-luc-yen-300ct-irrf207-2402300/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/da-ruby-facet-luc-yen-300ct-irrf207-2402300/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/da-ruby-facet-luc-yen-300ct-irrf207-2402300/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/da-ruby-facet-luc-yen-300ct-irrf207-2402300/#images-5'),
(32, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/da-ruby-cabochon-tu-nhien-100-185ct-irrc206-2401185/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/da-ruby-cabochon-tu-nhien-100-185ct-irrc206-2401185/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/da-ruby-cabochon-tu-nhien-100-185ct-irrc206-2401185/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/da-ruby-cabochon-tu-nhien-100-185ct-irrc206-2401185/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/da-ruby-cabochon-tu-nhien-100-185ct-irrc206-2401185/#images-5'),
(33, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-anh-chao-dong-122ct-irrf203-2401122/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-anh-chao-dong-122ct-irrf203-2401122/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-anh-chao-dong-122ct-irrf203-2401122/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-anh-chao-dong-122ct-irrf203-2401122/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-anh-chao-dong-122ct-irrf203-2401122/#images-5'),
(34, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-113ct-irrc196-2312113/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-113ct-irrc196-2312113/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-113ct-irrc196-2312113/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-113ct-irrc196-2312113/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-113ct-irrc196-2312113/#images-5'),
(35, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-097ct-irrc195-2312097/#images', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-097ct-irrc195-2312097/#images', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-097ct-irrc195-2312097/#images', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-097ct-irrc195-2312097/#images', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-097ct-irrc195-2312097/#images'),
(36, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-tu-nhien-100-098ct-irsr184-2312098/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-tu-nhien-100-098ct-irsr184-2312098/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-tu-nhien-100-098ct-irsr184-2312098/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-tu-nhien-100-098ct-irsr184-2312098/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-tu-nhien-100-098ct-irsr184-2312098/#images-5'),
(37, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-220ct-irrf182-2312220/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-220ct-irrf182-2312220/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-220ct-irrf182-2312220/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-220ct-irrf182-2312220/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-220ct-irrf182-2312220/#images-5'),
(38, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-co-sac-chao-dong-dep-175ct-irrf177-2312175/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-co-sac-chao-dong-dep-175ct-irrf177-2312175/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-co-sac-chao-dong-dep-175ct-irrf177-2312175/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-co-sac-chao-dong-dep-175ct-irrf177-2312175/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-co-sac-chao-dong-dep-175ct-irrf177-2312175/#images-5'),
(39, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-728ct-irrc173-2312728/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-728ct-irrc173-2312728/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-728ct-irrc173-2312728/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-728ct-irrc173-2312728/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-huyet-kinh-728ct-irrc173-2312728/#images-5'),
(40, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-nghe-an-343ct-tu-nhien-irsr140-238343n-irsr140-238343/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-nghe-an-343ct-tu-nhien-irsr140-238343n-irsr140-238343/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-nghe-an-343ct-tu-nhien-irsr140-238343n-irsr140-238343/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-nghe-an-343ct-tu-nhien-irsr140-238343n-irsr140-238343/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-nghe-an-343ct-tu-nhien-irsr140-238343n-irsr140-238343/#images-5'),
(41, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-5'),
(42, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/doi-ruby-facet-do-hong-luc-yen-150ct-irrf163-2311150/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/doi-ruby-facet-do-hong-luc-yen-150ct-irrf163-2311150/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/doi-ruby-facet-do-hong-luc-yen-150ct-irrf163-2311150/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/doi-ruby-facet-do-hong-luc-yen-150ct-irrf163-2311150/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/doi-ruby-facet-do-hong-luc-yen-150ct-irrf163-2311150/#images-5'),
(43, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-135ct-irrc161-2311135/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-135ct-irrc161-2311135/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-135ct-irrc161-2311135/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-135ct-irrc161-2311135/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-135ct-irrc161-2311135/#images-5'),
(44, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-hong-luc-yen-058ct-irrf153-2310058/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-hong-luc-yen-058ct-irrf153-2310058/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-hong-luc-yen-058ct-irrf153-2310058/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-hong-luc-yen-058ct-irrf153-2310058/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-hong-luc-yen-058ct-irrf153-2310058/#images-5'),
(45, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-076ct-irrf154-2310076/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-076ct-irrf154-2310076/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-076ct-irrf154-2310076/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-076ct-irrf154-2310076/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-076ct-irrf154-2310076/#images-5'),
(46, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-tu-nhien-062ct-irrf147-239062/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-tu-nhien-062ct-irrf147-239062/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-tu-nhien-062ct-irrf147-239062/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-tu-nhien-062ct-irrf147-239062/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-tu-nhien-062ct-irrf147-239062/#images-5'),
(47, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-165ct-luc-yen-irrf138-238165/#images-5'),
(48, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-mau-do-huyet-tu-nhien-163ct-irrf04-238163/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-mau-do-huyet-tu-nhien-163ct-irrf04-238163/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-mau-do-huyet-tu-nhien-163ct-irrf04-238163/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-mau-do-huyet-tu-nhien-163ct-irrf04-238163/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-mau-do-huyet-tu-nhien-163ct-irrf04-238163/#images-5'),
(49, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-hong-luc-yen-567ct-irrb-235567/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-hong-luc-yen-567ct-irrb-235567/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-hong-luc-yen-567ct-irrb-235567/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-hong-luc-yen-567ct-irrb-235567/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-hong-luc-yen-567ct-irrb-235567/#images-5'),
(50, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sao-net-248ct-irrb-237248/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sao-net-248ct-irrb-237248/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sao-net-248ct-irrb-237248/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sao-net-248ct-irrb-237248/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sao-net-248ct-irrb-237248/#images-5'),
(51, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-hang-tu-nhien-079ct-irrb-237079/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-hang-tu-nhien-079ct-irrb-237079/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-hang-tu-nhien-079ct-irrb-237079/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-hang-tu-nhien-079ct-irrb-237079/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-hang-tu-nhien-079ct-irrb-237079/#images-5'),
(52, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-sao-dep-xuat-sac-218ct-irrb-236218/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-sao-dep-xuat-sac-218ct-irrb-236218/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-sao-dep-xuat-sac-218ct-irrb-236218/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-sao-dep-xuat-sac-218ct-irrb-236218/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-sao-dep-xuat-sac-218ct-irrb-236218/#images-5'),
(53, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-450ct-irrb-236450/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-450ct-irrb-236450/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-450ct-irrb-236450/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-450ct-irrb-236450/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-450ct-irrb-236450/#images-5'),
(54, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-291ct-irrb-236291/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-291ct-irrb-236291/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-291ct-irrb-236291/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-291ct-irrb-236291/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-mau-do-huyet-291ct-irrb-236291/#images-5'),
(55, 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/vien-ruby-facet-luc-yen-tu-nhien-056ct-irrb-235056/#images-1', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/vien-ruby-facet-luc-yen-tu-nhien-056ct-irrb-235056/#images-2', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/vien-ruby-facet-luc-yen-tu-nhien-056ct-irrb-235056/#images-3', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/vien-ruby-facet-luc-yen-tu-nhien-056ct-irrb-235056/#images-4', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/vien-ruby-facet-luc-yen-tu-nhien-056ct-irrb-235056/#images-5'),
(56, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-5'),
(57, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-036ct-irrb-235036/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-036ct-irrb-235036/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-036ct-irrb-235036/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-036ct-irrb-235036/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-036ct-irrb-235036/#images-5'),
(58, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-luc-yen-mau-do-huyet-090ct-irrb-235090/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-luc-yen-mau-do-huyet-090ct-irrb-235090/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-luc-yen-mau-do-huyet-090ct-irrb-235090/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-luc-yen-mau-do-huyet-090ct-irrb-235090/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-luc-yen-mau-do-huyet-090ct-irrb-235090/#images-5'),
(59, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabachon-mau-do-huyet-092ct-irrb-235092/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabachon-mau-do-huyet-092ct-irrb-235092/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabachon-mau-do-huyet-092ct-irrb-235092/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabachon-mau-do-huyet-092ct-irrb-235092/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabachon-mau-do-huyet-092ct-irrb-235092/#images-4'),
(60, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-130ct-irrb-234130/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-130ct-irrb-234130/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-130ct-irrb-234130/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-130ct-irrb-234130/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-luc-yen-130ct-irrb-234130/#images-5'),
(61, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-tu-nhien-100-500ct-irrb-237500/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-tu-nhien-100-500ct-irrb-237500/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-tu-nhien-100-500ct-irrb-237500/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-tu-nhien-100-500ct-irrb-237500/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-cabachon/vien-ruby-cabochon-luc-yen-tu-nhien-100-500ct-irrb-237500/#images-5'),
(62, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-do-hong-tu-nhien-037ct-irrb-2350037/#images-5'),
(63, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-mau-chao-dong-070ct-irrb-235070/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-mau-chao-dong-070ct-irrb-235070/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-mau-chao-dong-070ct-irrb-235070/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-mau-chao-dong-070ct-irrb-235070/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-mau-chao-dong-070ct-irrb-235070/#images-5'),
(64, 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/doi-ruby-facet-luc-yen-tu-nhien-110ct-irrb-234110/#images-1', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/doi-ruby-facet-luc-yen-tu-nhien-110ct-irrb-234110/#images-2', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/doi-ruby-facet-luc-yen-tu-nhien-110ct-irrb-234110/#images-3', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/doi-ruby-facet-luc-yen-tu-nhien-110ct-irrb-234110/#images-4', 'https://iruby.vn/cua-hang/da-phong-thuy/theo-menh/doi-ruby-facet-luc-yen-tu-nhien-110ct-irrb-234110/#images-5'),
(65, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-huyet-bo-cau-facet-095ct-irrf-2302095/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-huyet-bo-cau-facet-095ct-irrf-2302095/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-huyet-bo-cau-facet-095ct-irrf-2302095/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-huyet-bo-cau-facet-095ct-irrf-2302095/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-huyet-bo-cau-facet-095ct-irrf-2302095/#images-5'),
(66, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sieu-net-1845ct-irrs-22111845/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sieu-net-1845ct-irrs-22111845/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sieu-net-1845ct-irrs-22111845/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sieu-net-1845ct-irrs-22111845/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-sao/vien-ruby-sao-yen-bai-sieu-net-1845ct-irrs-22111845/#images-5'),
(67, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/doi-da-ruby-huyet-kinh-325ct-irrb-2209325/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/doi-da-ruby-huyet-kinh-325ct-irrb-2209325/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/doi-da-ruby-huyet-kinh-325ct-irrb-2209325/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/doi-da-ruby-huyet-kinh-325ct-irrb-2209325/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/doi-da-ruby-huyet-kinh-325ct-irrb-2209325/#images-5'),
(68, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/vien-ruby-do-huyet-kinh-luc-yen-745ct-hang-tuyen-irrb-2207745/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/vien-ruby-do-huyet-kinh-luc-yen-745ct-hang-tuyen-irrb-2207745/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/vien-ruby-do-huyet-kinh-luc-yen-745ct-hang-tuyen-irrb-2207745/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/vien-ruby-do-huyet-kinh-luc-yen-745ct-hang-tuyen-irrb-2207745/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-huyet-kinh/vien-ruby-do-huyet-kinh-luc-yen-745ct-hang-tuyen-irrb-2207745/#images-5'),
(69, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-179ct-irrf-2206179/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-179ct-irrf-2206179/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-179ct-irrf-2206179/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-179ct-irrf-2206179/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-facet-luc-yen-179ct-irrf-2206179/#images-4'),
(70, 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-22ct-chieu-dep-irrf-2206220/#images-1', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-22ct-chieu-dep-irrf-2206220/#images-2', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-22ct-chieu-dep-irrf-2206220/#images-3', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-22ct-chieu-dep-irrf-2206220/#images-4', 'https://iruby.vn/cua-hang/da-quy/ruby/ruby-facet/vien-ruby-do-hong-luc-yen-22ct-chieu-dep-irrf-2206220/#images-5'),
(71, 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-thanh-hoa-287ct-iraq20-2404287/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-thanh-hoa-287ct-iraq20-2404287/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-thanh-hoa-287ct-iraq20-2404287/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-thanh-hoa-287ct-iraq20-2404287/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-thanh-hoa-287ct-iraq20-2404287/#images-5'),
(72, 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-100-294ct-iraq19-2404294/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-100-294ct-iraq19-2404294/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-100-294ct-iraq19-2404294/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-100-294ct-iraq19-2404294/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-100-294ct-iraq19-2404294/#images-5'),
(73, 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-500ct-iraq18-2403500/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-500ct-iraq18-2403500/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-500ct-iraq18-2403500/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-500ct-iraq18-2403500/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-500ct-iraq18-2403500/#images-5'),
(74, 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-350ct-iraq17-2403350/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-350ct-iraq17-2403350/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-350ct-iraq17-2403350/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-350ct-iraq17-2403350/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-350ct-iraq17-2403350/#images-5'),
(75, 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-529ct-iraq16-2403529/#images-1', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-529ct-iraq16-2403529/#images-2', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-529ct-iraq16-2403529/#images-3', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-529ct-iraq16-2403529/#images-4', 'https://iruby.vn/cua-hang/da-quy/da-aquamarine-xanh-bien-tu-nhien-529ct-iraq16-2403529/#images-5'),
(76, 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-658ct-iraq15-2402658/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-658ct-iraq15-2402658/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-658ct-iraq15-2402658/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-658ct-iraq15-2402658/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-658ct-iraq15-2402658/#images-5'),
(77, 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-417ct-iraq14-2402417/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-417ct-iraq14-2402417/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-417ct-iraq14-2402417/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-417ct-iraq14-2402417/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-417ct-iraq14-2402417/#images-5'),
(78, 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-773ct-iraq13-2402773/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-773ct-iraq13-2402773/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-773ct-iraq13-2402773/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-773ct-iraq13-2402773/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/aquamarine-xanh-duong/da-aquamarine-xanh-bien-tu-nhien-100-773ct-iraq13-2402773/#images-5'),
(79, 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-co-gam-mau-dep-nhat-430ct-iraq08-2401430/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-co-gam-mau-dep-nhat-430ct-iraq08-2401430/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-co-gam-mau-dep-nhat-430ct-iraq08-2401430/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-co-gam-mau-dep-nhat-430ct-iraq08-2401430/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-co-gam-mau-dep-nhat-430ct-iraq08-2401430/#images-5'),
(80, 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-tu-nhien-100-450ct-iraq07-2401450/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-tu-nhien-100-450ct-iraq07-2401450/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-tu-nhien-100-450ct-iraq07-2401450/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-tu-nhien-100-450ct-iraq07-2401450/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/da-aquamarine-xanh-bien-tu-nhien-100-450ct-iraq07-2401450/#images-5'),
(81, 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-tu-nhien-451ct-iraq6-2312451/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-tu-nhien-451ct-iraq6-2312451/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-tu-nhien-451ct-iraq6-2312451/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-tu-nhien-451ct-iraq6-2312451/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-tu-nhien-451ct-iraq6-2312451/#images-5'),
(82, 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-mau-xanh-duong-956ct-iraq5-2312956/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-mau-xanh-duong-956ct-iraq5-2312956/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-mau-xanh-duong-956ct-iraq5-2312956/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-mau-xanh-duong-956ct-iraq5-2312956/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-mau-xanh-duong-956ct-iraq5-2312956/#images-5'),
(83, 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/tinh-the-aqua-mau-xanh-lam-663g-iraq-236663/#images-5'),
(84, 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-304-ct-iraq-233304/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-304-ct-iraq-233304/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-304-ct-iraq-233304/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-304-ct-iraq-233304/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-duong-304-ct-iraq-233304/#images-5'),
(85, 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-tu-nhien-dep-tinh-te-iraq-221163/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-tu-nhien-dep-tinh-te-iraq-221163/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-tu-nhien-dep-tinh-te-iraq-221163/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-tu-nhien-dep-tinh-te-iraq-221163/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-tu-nhien-dep-tinh-te-iraq-221163/#images-5'),
(86, 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-nuoc-bien-995ct-iraq-2206995/#images-1', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-nuoc-bien-995ct-iraq-2206995/#images-2', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-nuoc-bien-995ct-iraq-2206995/#images-3', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-nuoc-bien-995ct-iraq-2206995/#images-4', 'https://iruby.vn/cua-hang/da-quy/aquamarine/vien-aquamarine-xanh-nuoc-bien-995ct-iraq-2206995/#images-4'),
(87, 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-333ct-irtm32-2401333/#images-1', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-333ct-irtm32-2401333/#images-2', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-333ct-irtm32-2401333/#images-3', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-333ct-irtm32-2401333/#images-4', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-333ct-irtm32-2401333/#images-5');
INSERT INTO `product_image` (`id`, `img_main`, `img_1`, `img_2`, `img_3`, `img_4`) VALUES
(88, 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-1', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-2', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-3', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-4', 'https://iruby.vn/cua-hang/da-quy/tourmaline/da-tourmaline-xanh-luc-sieu-ruc-334ct-irtm31-2401334/#images-5'),
(89, 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-tu-nhien-100-352ct-irtm29-2310352/#images-1', 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-tu-nhien-100-352ct-irtm29-2310352/#images-2', 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-tu-nhien-100-352ct-irtm29-2310352/#images-3', 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-tu-nhien-100-352ct-irtm29-2310352/#images-4', 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-tu-nhien-100-352ct-irtm29-2310352/#images-5'),
(90, 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-mau-xanh-luc-sang-355ct-irtm-235355/#images-1', 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-mau-xanh-luc-sang-355ct-irtm-235355/#images-2', 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-mau-xanh-luc-sang-355ct-irtm-235355/#images-3', 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-mau-xanh-luc-sang-355ct-irtm-235355/#images-4', 'https://iruby.vn/cua-hang/da-quy/tourmaline/vien-tourmaline-mau-xanh-luc-sang-355ct-irtm-235355/#images-5'),
(91, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-luc-yen-tu-nhien-100-530ct-irgn113-2401530/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-luc-yen-tu-nhien-100-530ct-irgn113-2401530/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-luc-yen-tu-nhien-100-530ct-irgn113-2401530/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-luc-yen-tu-nhien-100-530ct-irgn113-2401530/#images-4', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-luc-yen-tu-nhien-100-530ct-irgn113-2401530/#images-5'),
(92, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-175ct-irgn112-2401175/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-175ct-irgn112-2401175/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-175ct-irgn112-2401175/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-175ct-irgn112-2401175/#images-4', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-175ct-irgn112-2401175/#images-5'),
(93, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-237ct-irgn111-2401273/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-237ct-irgn111-2401273/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-237ct-irgn111-2401273/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-237ct-irgn111-2401273/#images-4', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/da-garnet-luc-yen-tu-nhien-100-237ct-irgn111-2401273/#images-4'),
(94, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-mau-do-hong-tu-nhien-100-219ct-irgn108-2401219/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-mau-do-hong-tu-nhien-100-219ct-irgn108-2401219/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-mau-do-hong-tu-nhien-100-219ct-irgn108-2401219/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-mau-do-hong-tu-nhien-100-219ct-irgn108-2401219/#images-4', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-do/da-garnet-mau-do-hong-tu-nhien-100-219ct-irgn108-2401219/#images-5'),
(95, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-garnet-mau-xanh-tao-hiem-gap-415ct-irgn-235415/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-garnet-mau-xanh-tao-hiem-gap-415ct-irgn-235415/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-garnet-mau-xanh-tao-hiem-gap-415ct-irgn-235415/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-garnet-mau-xanh-tao-hiem-gap-415ct-irgn-235415/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-garnet-mau-xanh-tao-hiem-gap-415ct-irgn-235415/#images-5'),
(96, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-tsavorite-xanh-luc-bao-hiem-co-32ct-irts-221132/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-tsavorite-xanh-luc-bao-hiem-co-32ct-irts-221132/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-tsavorite-xanh-luc-bao-hiem-co-32ct-irts-221132/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-tsavorite-xanh-luc-bao-hiem-co-32ct-irts-221132/#images-4', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-xanh/vien-tsavorite-xanh-luc-bao-hiem-co-32ct-irts-221132/#images-5'),
(97, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-trai-tim-mau-hong-tim-300ct-irgn82-233300/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-trai-tim-mau-hong-tim-300ct-irgn82-233300/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-trai-tim-mau-hong-tim-300ct-irgn82-233300/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-trai-tim-mau-hong-tim-300ct-irgn82-233300/#images-4', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-trai-tim-mau-hong-tim-300ct-irgn82-233300/#images-5'),
(98, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-099ct-irgn-234099/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-099ct-irgn-234099/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-099ct-irgn-234099/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-099ct-irgn-234099/#images-4', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-099ct-irgn-234099/#images-5'),
(99, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-287ct-irgn-233287/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-287ct-irgn-233287/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-287ct-irgn-233287/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-287ct-irgn-233287/#images-4', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-garnet-mau-do-tim-287ct-irgn-233287/#images-4'),
(100, 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-rhodolite-garnet-dep-hien-dai-234ct-irgn-233234/#images-1', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-rhodolite-garnet-dep-hien-dai-234ct-irgn-233234/#images-2', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-rhodolite-garnet-dep-hien-dai-234ct-irgn-233234/#images-3', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-rhodolite-garnet-dep-hien-dai-234ct-irgn-233234/#images-4', 'https://iruby.vn/cua-hang/da-quy/garnet-da-quy/garnet-hong-luu/vien-rhodolite-garnet-dep-hien-dai-234ct-irgn-233234/#images-4'),
(101, 'http://res.cloudinary.com/dvarqsigv/image/upload/v1718892483/download%20%281%29.jfif.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1718892489/download%20%282%29.jfif.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1718892495/download%20%283%29.jfif.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1718892500/download%20%284%29.jfif.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1718892504/download.jfif.jpg'),
(102, 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg'),
(103, 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg'),
(104, 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg'),
(105, 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg'),
(106, 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg'),
(107, 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg', 'http://res.cloudinary.com/dvarqsigv/image/upload/v1720225036/anh-dep-thien-nhien-2-1.jpg.jpg');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `full_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'user',
  `gender` enum('nam','nu','khac') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `birthday` datetime DEFAULT NULL,
  `email` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `avatar` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT '../img/avatar.png',
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT NULL,
  `delete_at` datetime DEFAULT NULL,
  `role` enum('user','admin','prohibit') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'user',
  `status` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `type_login` enum('web','facebook','google') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'web'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `full_name`, `gender`, `birthday`, `email`, `phone`, `address`, `avatar`, `created_at`, `updated_at`, `delete_at`, `role`, `status`, `type_login`) VALUES
(1, 'tan', 'hihhaha', 'user', 'nu', '2024-06-20 21:15:01', 'tam@gmail.com', '0918247523', 'mach thi lieu', '/DaQuyStore_war/img/avatar.png', '2024-03-31 19:12:51', '2024-04-10 23:06:58', '2024-03-31 14:11:39', 'user', 'chưa xóa', 'web'),
(3, 'tai', 'hihihaha', 'tai', 'nam', '2024-06-26 21:15:03', 'tai@gmail.com', '0932746373', 'mach thi lieu', '/DaQuyStore_war/img/avatar.png', '2024-04-02 10:50:30', '2024-06-13 21:17:27', '2024-04-02 05:45:42', 'user', 'chưa xóa', 'web'),
(16, '21130525@st.hcmuaf.edu.vn', 'hihhaha', 'Tâm Lê Thanh', 'nam', '2024-06-26 21:15:06', '21130525@st.hcmuaf.edu.vn', '0909323573', 'mach thi lieu', 'https://lh3.googleusercontent.com/a/ACg8ocI_nFQBuGF1zpQF5qrv9GUrDzI2v3FJaAO8Qjpn9RxiQ0DJ-Zw=s96-c', '2024-04-17 17:08:08', '2024-06-11 21:17:29', '2024-06-12 21:17:32', 'user', 'đã xóa', 'google'),
(27, 'qa', '111hihi', 'le thanh tam', 'nam', '2020-06-25 00:00:00', 'tam1442k3@gmail.com', '0343381360', 'ba ria vung tau', '/DaQuyStore_war/img/avatar.png', '2024-07-05 14:58:06', '2024-07-06 11:39:08', '2024-07-10 18:37:28', 'admin', 'đã xóa', 'web');

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `activacation_code`
--
ALTER TABLE `activacation_code`
  ADD PRIMARY KEY (`activationCode`);

--
-- Chỉ mục cho bảng `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `inventories`
--
ALTER TABLE `inventories`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `inventory_detail`
--
ALTER TABLE `inventory_detail`
  ADD PRIMARY KEY (`id`,`product_id`);

--
-- Chỉ mục cho bảng `log`
--
ALTER TABLE `log`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Chỉ mục cho bảng `order_details`
--
ALTER TABLE `order_details`
  ADD KEY `order_id` (`order_id`),
  ADD KEY `product_id` (`product_id`);

--
-- Chỉ mục cho bảng `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `image_product` (`image_product`);

--
-- Chỉ mục cho bảng `product_image`
--
ALTER TABLE `product_image`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`,`email`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT cho bảng `inventories`
--
ALTER TABLE `inventories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=373;

--
-- AUTO_INCREMENT cho bảng `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;

--
-- AUTO_INCREMENT cho bảng `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=108;

--
-- AUTO_INCREMENT cho bảng `product_image`
--
ALTER TABLE `product_image`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=108;

--
-- AUTO_INCREMENT cho bảng `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Các ràng buộc cho bảng `order_details`
--
ALTER TABLE `order_details`
  ADD CONSTRAINT `order_details_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`),
  ADD CONSTRAINT `order_details_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`);

--
-- Các ràng buộc cho bảng `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `fk_img` FOREIGN KEY (`image_product`) REFERENCES `product_image` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
